---
layout: default
title: 'Microsoft SQL Server nom de code Denali CTP3 - Notes de publication (fr-FR) - TechNet Articles - United States (English) - TechNet Wiki'
weight: 3
---

<div class="post-content user-defined-markup"><div class="introduction">
<p><a href="http://social.technet.microsoft.com/wiki/contents/articles/3752.aspx">Cliquez ici pour changer la langue</a>.</p>
<p>Ces notes de version sont soigneusement et &eacute;troitement surveill&eacute;es. Toute modification apport&eacute;e sera &eacute;valu&eacute;e, puis rapidement accept&eacute;e, raffin&eacute;e ou annul&eacute;e. Comme il s&#39;agit d&#39;un wiki, des ajouts ou des am&eacute;liorations apport&eacute;es &agrave; ces notes de publication pourrait avoir &eacute;t&eacute; faites par les membres de la communaut&eacute;. Pour lire le document de notes de version officiel et original, <a href="http://social.technet.microsoft.com/wiki/contents/articles/3744/revision/2.aspx"><span style="color:#0066dd;">cliquez ici</span></a>.</p>
<p>Ce document Notes de publication d&eacute;crit les probl&egrave;mes connus que vous devez examiner avant d&#39;installer ou de d&eacute;panner SQL Server nom de code &laquo; Denali &raquo; CTP3 (<a href="http://go.microsoft.com/?linkid=9776822">cliquez ici pour le t&eacute;l&eacute;charger</a>). Ce document Notes de publication, uniquement disponible en ligne (absent du support d&#39;installation), est r&eacute;guli&egrave;rement mis &agrave; jour.</p>
<p>Pour plus d&#39;informations sur le d&eacute;marrage et l&#39;installation de SQL Server nom de code &laquo; Denali &raquo;, consultez le fichier Lisezmoi de SQL Server nom de code &laquo; Denali &raquo;. Le document Lisezmoi est disponible sur le support d&#39;installation et sur la page de t&eacute;l&eacute;chargement du fichier <a href="http://go.microsoft.com/?linkid=9768757">Lisezmoi</a>. Pour des informations compl&eacute;mentaires, consultez la rubrique <a href="http://go.microsoft.com/?linkid=9776341">Documentation en ligne SQL Server</a> et les <a href="http://go.microsoft.com/?linkid=9753169">forums SQL Server &laquo; Denali &raquo;</a>.</p>
</div>
<a name="Contents">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Sommaire"></a>Sommaire</h1>
<div id="sectionSection0" class="section">
<p><a href="#Avant_l_installation">1.0 Avant l&#39;installation</a></p>
<p><a href="#Analysis_Services">2.0 Analysis Services</a></p>
<p><a href="#Documentation_en_ligne">3.0 Documentation en ligne</a></p>
<p><a href="#Data_Quality_Services">4.0 Data Quality Services</a></p>
<p><a href="#Database_Engine">5.0 Database Engine</a></p>
<p><a href="#Integration_Services">6.0 Integration Services</a></p>
<p><a href="#Master_Data_Services">7.0 Master Data Services</a></p>
<p><a href="#Reporting_Services">8.0 Reporting Services</a></p>
<p><a href="#StreamInsight">9.0 StreamInsight</a></p>
<p><a href="#Upgrade_Advisor">10.0 Upgrade Advisor</a></p>
<p><a href="#Recherche_d_autres_probl_egrave_mes_connus">11.0 Recherche d&#39;autres probl&egrave;mes connus</a></p>
</div>
<a name="Before_You_Install">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Avant_l_installation"></a>1.0 Avant l&#39;installation</h1>
<div>
<p>Lisez les actions requises r&eacute;pertori&eacute;es ci-dessous avant d&#39;installer SQL Server nom de code &laquo; Denali &raquo;.</p>
</div>
<div>
<div>
<div class="subsection">
<h3 class="subHeading"><a name="Installation_des_composants_requis_pendant_l_installation_de_SQL_Server_nom_de_code_Denali"></a>1.1 Installation des composants requis pendant l&#39;installation de SQL Server nom de code &#39;Denali&#39;</h3>
<p>Les points suivants d&eacute;crivent le comportement d&#39;installation pr&eacute;requis pendant l&#39;installation de SQL Server nom de code &laquo; Denali &raquo; :</p>
<ul>
    <li>
    <p>L&#39;installation de SQL Server nom de code Denali est prise en charge uniquement sous Windows 7 SP1 ou Windows Server 2008 R2 SP1. Toutefois, le programme d&#39;installation ne bloque pas l&#39;installation de SQL Server nom de code Denali sous Windows 7 ou Windows Server 2008 R2.</p>
    </li>
    <li>
    <p>.NET 3.5 SP1 est requis pour SQL Server nom de code Denali lorsque vous s&eacute;lectionnez les services Database Engine, Replication, Master Data Services, Reporting Services, Data Quality Services (DQS) ou SQL Server Management Studio, mais l&#39;infrastructure n&#39;est plus install&eacute;e par le programme d&#39;installation de SQL Server.</p>
    <ul>
        <li>
        <p>Si vous ex&eacute;cutez le programme d&#39;installation sur un ordinateur avec le syst&egrave;me d&#39;exploitation Windows Vista SP2 ou Windows Server 2008 SP2 et que .NET Framework 3.5 SP1 n&#39;y est pas install&eacute;, le programme d&#39;installation de SQL Server exige que .NET Framework 3.5 SP1 soit t&eacute;l&eacute;charg&eacute; et install&eacute; avant de vous laisser continuer l&#39;installation de SQL Server. Le message d&#39;erreur inclut un lien vers le centre de t&eacute;l&eacute;chargement, ou vous pouvez t&eacute;l&eacute;charger .NET Framework 3.5 SP1 depuis Windows Update. Pour &eacute;viter toute interruption pendant l&#39;installation de SQL Server, vous pouvez t&eacute;l&eacute;charger et installer .NET Framework 3.5 SP1 avant d&#39;ex&eacute;cuter le programme d&#39;installation de SQL Server. </p>
        </li>
        <li>
        <p>Si vous ex&eacute;cutez le programme d&#39;installation sur un ordinateur &eacute;quip&eacute; du syst&egrave;me d&#39;exploitation Windows 7 SP1 ou Windows Server 2008 R2 SP1, vous devez activer .NET Framework 3.5 SP1 avant d&#39;installer SQL Server nom de code &laquo; Denali &raquo;.</p>
        </li>
    </ul>
    </li>
    <li>
    <p>.NET Framework 4 est un &eacute;l&eacute;ment requis pour SQL Server nom de code &laquo; Denali &raquo;. Le programme d&#39;installation de SQL Server installe .NET Framework 4 pendant l&#39;&eacute;tape d&#39;installation des fonctionnalit&eacute;s. SQL Server Express n&#39;installe pas .NET Framework 4 lors de l&#39;installation sur le syst&egrave;me d&#39;exploitation Windows Server 2008 R2 SP1 Server Core. Vous devez installer .NET Framework 4 avant d&#39;installer SQL Server Express sur un syst&egrave;me d&#39;exploitation Windows Server 2008 R2 SP1 Server Core.</p>
    </li>
    <li>
    <p>Pour garantir l&#39;installation correcte du composant Visual Studio, SQL Server vous oblige &agrave; installer une mise &agrave; jour. Le programme d&#39;installation de SQL Server v&eacute;rifie la pr&eacute;sence de cette mise &agrave; jour, puis vous demande de t&eacute;l&eacute;charger et d&#39;installer la mise &agrave; jour pour que l&#39;installation puisse se poursuivre. Pour &eacute;viter l&#39;interruption pendant l&#39;installation de SQL Server, vous pouvez t&eacute;l&eacute;charger et installer la mise &agrave; jour avant d&#39;ex&eacute;cuter le programme d&#39;installation de SQL Server, tel que d&eacute;crit ci-dessous (ou installer toutes les mises &agrave; jour de .NET Framework 3.5 SP1 disponibles sur Windows Update) : </p>
    <ul>
        <li>
        <p>Si vous installez SQL Server nom de code &laquo; Denali &raquo; sur un ordinateur dot&eacute; du syst&egrave;me d&#39;exploitation Windows Vista SP2 ou Windows Server 2008 SP2, vous pouvez obtenir la mise &agrave; jour requise <a href="http://go.microsoft.com/fwlink/?LinkId=198093">ici</a>.</p>
        </li>
        <li>
        <p>Si vous installez SQL Server nom de code &laquo; Denali &raquo; sur un ordinateur &eacute;quip&eacute; du syst&egrave;me d&#39;exploitation Windows 7 SP1 ou Windows Server 2008 R2 SP1, cette mise &agrave; jour est d&eacute;j&agrave; install&eacute;e.</p>
        </li>
    </ul>
    </li>
    <li>Windows PowerShell 2.0 est un &eacute;l&eacute;ment pr&eacute;requis pour l&#39;installation des composants de moteur de base de donn&eacute;es SQL Server nom de code &laquo; Denali &raquo; et de SQL Server Management Studio, mais Windows PowerShell n&#39;est plus install&eacute; par le programme d&#39;installation SQL Server. Si PowerShell 2.0 n&#39;est pas pr&eacute;sent sur votre ordinateur, vous pouvez l&#39;activer en suivant les instructions de la page <a href="http://go.microsoft.com/?linkid=9745645">Structure de gestion Windows</a>. </li>
</ul>
<h3 class="subHeading"><a name="Syst_egrave_mes_d_exploitation_pris_en_charge_pour_SQL_Server_nom_de_code_Denali_Eacute_dition_Eacute_valuation"></a>1.2 Syst&egrave;mes d&#39;exploitation pris en charge pour SQL Server nom de code Denali &Eacute;dition &Eacute;valuation</h3>
<div class="subsection">
<p>SQL Server nom de code &laquo; Denali &raquo; &Eacute;dition &Eacute;valuation est pris en charge sur les syst&egrave;mes d&#39;exploitation Windows Vista SP2, Windows 2008 R2 SP1, Windows 2008 R2 et Windows 7.</p>
<h3 class="subHeading"><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a><a name="Installation_de_SQL_Server_nom_de_code_Denali_sous_Windows_Server_2008_R2_Server_Core_Service_Pack_1"></a>1.3 Installation de SQL Server nom de code Denali sous Windows Server 2008 R2 Server Core Service Pack 1</h3>
<p>Si vous commencez par SQL Server nom de code &laquo; Denali &raquo; CTP3, vous pouvez installer SQL Server sous Windows Server 2008 R2 Server Core SP1, avec les restrictions suivantes :</p>
<ul>
    <li>Microsoft SQL Server nom de code &laquo; Denali &raquo;, version pr&eacute;liminaire CTP3 (Community Technology Preview 3) ne prend pas en charge l&#39;installation avec l&#39;Assistant Installation sur le syst&egrave;me d&#39;exploitation Server Core. Lors de l&#39;installation sous Server Core, le programme d&#39;installation SQL Server prend en charge le mode silencieux complet via le param&egrave;tre /Q ou le mode silencieux simple via le param&egrave;tre /QS. </li>
    <li>La mise &agrave; niveau d&#39;une version ant&eacute;rieure de SQL Server vers Microsoft SQL Server nom de code &laquo; Denali &raquo;, version pr&eacute;liminaire CTP3, n&#39;est pas prise en charge sur un ordinateur ex&eacute;cutant Windows Server 2008 R2 Server Core SP1. </li>
    <li>L&#39;installation d&#39;une version 32 bits de Microsoft SQL Server nom de code &laquo; Denali &raquo; CTP 3 n&#39;est pas prise en charge sur un ordinateur ex&eacute;cutant Windows Server 2008 R2 Server Core SP1. </li>
    <li>Microsoft SQL Server nom de code &laquo; Denali &raquo; CTP 3 ne peut pas &ecirc;tre install&eacute; c&ocirc;te &agrave; c&ocirc;te avec des versions ant&eacute;rieures de SQL Server sur un ordinateur ex&eacute;cutant Windows Server 2008 R2 Server Core SP1. </li>
    <li>Lorsque vous essayez de lancer le programme d&#39;installation SQL Server en ex&eacute;cutant &laquo; setup.exe /QS &raquo; sur Server Core sans sp&eacute;cifier /Action, le programme ouvre le Centre d&#39;installation SQL Server et n&#39;&ecirc;tes pas en mesure de proc&eacute;der &agrave; l&#39;installation. La solution consiste &agrave; sp&eacute;cifier une action &agrave; l&#39;aide du param&egrave;tre de ligne de commande /Action. </li>
    <li>Microsoft Sync Framework est pris en charge sur Windows Server 2008 R2 Server Core SP1. Vous pouvez installer la version appropri&eacute;e de Sync Framework &agrave; partir de cette <a href="http://go.microsoft.com/fwlink/?LinkId=221788" target="_blank">page du centre de t&eacute;l&eacute;chargement Microsoft</a> (<a href="http://go.microsoft.com/fwlink/?LinkId=221788">http://go.microsoft.com/fwlink/?LinkId=221788</a>) et l&#39;installer sur un ordinateur ex&eacute;cutant Windows Server 2008 R2 Server Core SP1. </li>
</ul>
<h3 class="subHeading"><a name="Mise_agrave_jour_d_essai_disponible_pour_tester_la_nouvelle_fonctionnalit_eacute_de_mise_agrave_jour_de_produit"></a>1.4 Mise &agrave; jour d&#39;essai disponible pour tester la nouvelle fonctionnalit&eacute; de mise &agrave; jour de produit</h3>
<p>Dans cette version de SQL Server, vous pouvez essayer la nouvelle fonctionnalit&eacute; de mise &agrave; jour de produit. Cette fonctionnalit&eacute; comprend les derni&egrave;res mises &agrave; jour du produit avec l&#39;installation du produit principal, de sorte que le produit principal et ses mises &agrave; jour applicables soient install&eacute;es en m&ecirc;me temps. La fonctionnalit&eacute; de mise &agrave; jour du produit peut rechercher les mises &agrave; jour applicables dans Microsoft Update, les services de mise &agrave; jour Windows Server (WSUS), un dossier local ou un partage r&eacute;seau.</p>
<p>Pour cette version de CTP, la mise &agrave; jour d&#39;essai ne sera pas distribu&eacute;e &agrave; WSUS. Avec la version SQL Server 2011, les mises &agrave; jour seront disponibles pour WSUS sous le produit &laquo; SQL Server 2011 Product Updates For Setup &raquo;. Une fois l&#39;approbation de l&#39;administrateur WSUS obtenue, tout client pointant vers le service WSUS verra ces mises &agrave; jour. Pour cette version de CTP, il vous est encore possible de v&eacute;rifier la fonctionnalit&eacute; WSUS en l&#39;important depuis le catalogue de Microsoft Update. Pour cela, proc&eacute;dez comme suit :</p>
<ol>
    <li>Cliquez avec le bouton droit sur le n&oelig;ud <strong>Mises &agrave; jour</strong> dans votre serveur WSUS, puis cliquez sur <strong>Importer des mises &agrave; jour</strong>. </li>
    <li>Dans la zone <strong>Rechercher</strong>, recherchez <strong>SQL Server &laquo; Denali &raquo; CTP3 Test Update</strong>. </li>
    <li>S&eacute;lectionnez la mise &agrave; jour &agrave; ajouter, et cliquez sur <strong>Afficher panier</strong>. </li>
    <li>S&eacute;lectionnez <strong>Importer directement dans les services de mise &agrave; jour Windows Server</strong>. </li>
    <li>Approuvez la mise &agrave; jour import&eacute;e. </li>
</ol>
<p>Pour plus d&#39;informations sur la fonctionnalit&eacute; de mises &agrave; jour de produit dans SQL Server nom de code &laquo; Denali &raquo;, reportez-vous &agrave; la section &laquo; Mises &agrave; jour de produit &raquo; dans la rubrique Installation de &laquo; Denali &raquo;.</p>
</div>
<h3 class="subHeading"><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a><a name="Erreur_d_installation_sous_Windows_Vista_et_Windows_Server_2008"></a>1.5 Erreur d&#39;installation sous Windows Vista et Windows Server 2008</h3>
<div class="subsection">
<p>SQL Server nom de code &laquo; Denali &raquo; requiert Windows PowerShell 2.0. PowerShell 2.0 ne peut actuellement pas &ecirc;tre install&eacute; sous Windows Vista ou Windows Server 2008 si la langue du syst&egrave;me d&#39;exploitation figure parmi les 11 langues suivantes : bulgare (Bulgarie), estonien (Estonie), croate (Croatie), lithuanien (Lithuanie), letton (Lettonie), slovaque (Slovaquie), slov&egrave;ne (Slov&eacute;nie), serbe (latin, Serbie), roumain (Roumanie), tha&iuml; (Tha&iuml;lande) ou ukrainien (Ukraine). L&#39;erreur suivante risque d&#39;appara&icirc;tre :</p>
<p class="style1"><em>&laquo; Ce package ne peut s&#39;appliquer. &raquo;</em></p>
</div>
<h3 class="subHeading"><a name="Impossible_de_renommer_la_ressource_de_nom_de_r_eacute_seau_SQL_dans_SQL_Server_nom_de_code_laquo_Denali_raquo"></a>1.6 Impossible de renommer la ressource de nom de r&eacute;seau SQL dans SQL Server nom de code &laquo; Denali &raquo;</h3>
<div class="subsection">
<p>SQL Server nom de>SQL Server nom de code &laquo; Denali &raquo; requiert Windows PowerShell 2.0. PowerShell 2.0 ne peut actuellement pas &ecirc;tre install&eacute; sous Windows Vista ou Windows Server 2008 si la langue du syst&egrave;me d&#39;exploitation figure parmi les 11 langues suivantes : bulgare (Bulgarie), estonien (Estonie), croate (Croatie), lithuanien (Lithuanie), letton (Lett code &laquo; Denali &raquo; ne peut pas renommer la ressource de nom de r&eacute;seau SQL. Si vous renommez une ressource de nom de r&eacute;seau SQL existante &agrave; l&#39;aide de l&#39;administrateur de clusters Windows, la mise &agrave; niveau SQL Server et d&#39;autres op&eacute;rations d&#39;installation de l&#39;instance de cluster renomm&eacute;e risque d&#39;&eacute;chouer.</p>
</div>
<h3 class="subHeading"><a name="Eacute_chec_de_la_validation_du_nom_d_instance_se_terminant_par_pendant_l_installation_de_l_environnement_en_cluster"></a>1.7 &Eacute;chec de la validation du nom d&#39;instance se terminant par &#39;$&#39; pendant l&#39;installation de l&#39;environnement en cluster</h3>
<div class="subsection">
<p>Le programme d&#39;installation SQL Server oblige l&#39;utilisateur &agrave; d&eacute;finir le nom d&#39;instance pour les nouvelles installations. Si vous d&eacute;finissez un nom d&#39;instance se terminant par &laquo; $ &raquo;, dans la page <strong>Configuration du serveur</strong> dans laquelle les comptes des services sont identifi&eacute;s, le programme d&#39;installation ne parvient pas &agrave; valider les comptes par d&eacute;faut issus des noms d&#39;instance. L&#39;erreur de validation suivante appara&icirc;tra dans l&#39;interface utilisateur de l&#39;installation ou dans le journal d&#39;installation Detail.txt si l&#39;installation est ex&eacute;cut&eacute;e sur la ligne de commande :</p>
<p class="style1"><em>&laquo; Le nom fourni n&#39;est pas un nom de compte form&eacute; correctement. &raquo;</em></p>
<p><strong>Solution :</strong> changez le nom d&#39;instance en veillant &agrave; ne pas le terminer par &laquo; $ &raquo;. L&#39;autre m&eacute;thode consiste &agrave; modifier les comptes de service se terminant par &laquo; $ &raquo; et &agrave; utiliser un autre compte, tel qu&#39;un compte destin&eacute; &agrave; cette utilisation.</p>
</div>
<div class="subsection">
<h3 class="subHeading"><a name="La_recherche_s_eacute_mantique_exige_l_installation_d_une_d_eacute_pendance_suppl_eacute_mentaire"></a>1.8 La recherche s&eacute;mantique exige l&#39;installation d&#39;une d&eacute;pendance suppl&eacute;mentaire</h3>
<div class="subsection">
<p>La recherche s&eacute;mantique statistique pr&eacute;sente une condition pr&eacute;alable suppl&eacute;mentaire, &agrave; savoir la base de donn&eacute;es des statistiques linguistiques de s&eacute;mantique, qui n&#39;est pas install&eacute;e par le programme d&#39;installation SQL Server.</p>
<p><strong>Solution :</strong> Pour installer la base de donn&eacute;es des statistiques linguistiques de s&eacute;mantique comme une condition pr&eacute;alable &agrave; l&#39;indexation s&eacute;mantique, proc&eacute;dez comme suit : </p>
<ol>
    <li>Localisez et ex&eacute;cutez le package Windows Installer nomm&eacute; <strong>SemanticLanguageDatabase.msi </strong>sur le support d&#39;installation de SQL Server pour extraire la base de donn&eacute;es. Pour SQL Server Code-Named &laquo; Denali &raquo; Express, t&eacute;l&eacute;chargez la base de donn&eacute;es des statistiques linguistiques de s&eacute;mantique &agrave; partir du <a href="http://go.microsoft.com/fwlink/?LinkId=221787">centre de t&eacute;l&eacute;chargement Microsoft</a> (<a href="http://go.microsoft.com/fwlink/?LinkId=221787">http://go.microsoft.com/fwlink/?LinkId=221787</a>), puis ex&eacute;cutez le package Windows Installer. </li>
    <li>D&eacute;placez la base de donn&eacute;es vers un dossier de donn&eacute;es appropri&eacute;. Si vous laissez la base de donn&eacute;es dans l&#39;emplacement par d&eacute;faut, vous devez modifier les droits avant de pouvoir l&#39;attacher. </li>
    <li>Attachez la base de donn&eacute;es extraite. </li>
    <li>Enregistrez la base de donn&eacute;es en appelant la proc&eacute;dure stock&eacute;e <strong>sp_fulltext_semantic_register_language_statistics_db</strong> et en fournissant le nom attribu&eacute; &agrave; la base de donn&eacute;es lors de son attachement. </li>
</ol>
<p>Si ces t&acirc;ches ne sont pas men&eacute;es &agrave; bien, le message d&#39;erreur suivant s&#39;affichera lorsque vous tenterez de cr&eacute;er un index s&eacute;mantique :</p>
<p class="style1"><em>Msg 41209, Niveau 16, &Eacute;tat 3, Ligne 1 </em></p>
<p class="style1"><em>Une base de donn&eacute;es de statistiques linguistiques de s&eacute;mantique n&#39;est pas inscrite. Impossible de cr&eacute;er ou de remplir des index de recherche en texte int&eacute;gral utilisant &#39;STATISTICAL_SEMANTICS&#39;.</em></p>
<h3 class="subHeading"><a name="Sync_Framework_n_est_pas_inclus_dans_le_package_d_installation"></a>1.9 Sync Framework n&#39;est pas inclus dans le package d&#39;installation</h3>
<div class="subsection">
<p>Sync Framework n&#39;est pas inclus dans le package d&#39;installation de SQL Server nom de code &laquo; Denali &raquo;. Vous pouvez t&eacute;l&eacute;charger et installer la version appropri&eacute;e de Sync Framework &agrave; partir de </p>
</div>
<div class="subsection">
<p><span style="color:#ffffff;text-decoration:none;"><a href="http://go.microsoft.com/?linkid=9776342">cette page du Centre de t&eacute;l&eacute;chargement Microsoft</a>.</span></p>
<a name="Analysis_Services8">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a></h3>
<h3 class="subHeading"><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a><a name="Utilisation_des_fonctionnalit_eacute_s_SharePoint_de_Denali_requises_pour_SharePoint_Server_2010_SP1"></a>1.10 Utilisation des fonctionnalit&eacute;s SharePoint de Denali requises pour SharePoint Server 2010 SP1</h3>
<p>Si vous envisagez d&#39;utiliser les fonctionnalit&eacute;s SQL Server nom de code &laquo; Denali &raquo; dans un environnement SharePoint, SharePoint Server 2010 Service Pack 1 (SP1) est requis. </p>
<p><strong>Solution</strong> : vous devez installer SP1 et corriger int&eacute;gralement la batterie de serveurs avant de lui ajouter les fonctionnalit&eacute;s SQL Server. Cette condition requise concerne les fonctionnalit&eacute;s Denali son_des_fonctionnalit_eacute_s_SharePoint_de_Denali_uivantes : l&#39;utilisation d&#39;un moteur de base de donn&eacute;es en tant que serveur de base de donn&eacute;es de la batterie de serveurs, la configuration de PowerPivot pour SharePoint et le d&eacute;ploiement de Reporting Services en mode SharePoint.</p>
</div>
</div>
</div>
</div>
</div>
</div>
<p><a>[Haut]</a></p>
<a name="Analysis_Services">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Analysis_Services"></a>2.0 Analysis Services</h1>
<div></div>
<div>
<h3 class="subHeading"><a name="Impossible_de_cr_eacute_er_ou_d_ouvrir_des_projets_tabulaires_lorsque_le_nom_de_groupe_BUILTIN_Administrateurs_ne_peut_pas_ecirc_tre_r_eacute_solu"></a>2.1 Impossible de cr&eacute;er ou d&#39;ouvrir des projets tabulaires lorsque le nom de groupe BUILTIN\Administrateurs ne peut pas &ecirc;tre r&eacute;solu</h3>
<p>Pour pouvoir cr&eacute;er ou ouvrir des projets tabulaires, vous devez &ecirc;tre administrateur de la base de donn&eacute;es d&#39;espace de travail. Un utilisateur peut &ecirc;tre ajout&eacute; au groupe d&#39;administrateurs du serveur en ajoutant le nom de l&#39;utilisateur ou du groupe. Si vous appartenez au groupe BUILTIN\Administrateur, vous ne pouvez pas cr&eacute;er ni &eacute;diter les fichiers BIM, &agrave; moins que le serveur de base de donn&eacute;es d&#39;espace de travail soit joint au domaine &agrave; partir duquel il a &eacute;t&eacute; initialement configur&eacute;. Si vous ouvrez ou cr&eacute;ez un fichier BIM, ce dernier &eacute;chouera et le message suivant s&#39;affichera :</p>
<p class="style1"><em>&quot; Impossible d&#39;ouvrir le fichier BIM. Le serveur auquel il est connect&eacute; n&#39;est pas valide. Raison : vous n&#39;&ecirc;tes pas administrateur du serveur [nom du serveur]. &raquo;</em></p>
<p><strong>Solutions :</strong></p>
<ul>
    <li>Joignez de nouveau le serveur de base de donn&eacute;es d&#39;espace de travail et l&#39;ordinateur Business Intelligence Development Studio (BIDS) au domaine. </li>
    <li>Si le serveur de base de donn&eacute;es d&#39;espace de travail et/ou les ordinateurs BIDS ne sont pas joints au domaine de mani&egrave;re permanente, ajoutez des noms d&#39;utilisateur individuels &agrave; la place du groupe BUILTIN\Administrateurs comme administrateurs du serveur de base de donn&eacute;es d&#39;espace de travail. </li>
</ul>
<h3 class="subHeading"><a name="Les_abonnements_pilot_eacute_s_par_des_donn_eacute_es_RS_risquent_de_ne_pas_fonctionner_avec_une_source_de_donn_eacute_es_AS"></a>2.2 Les abonnements pilot&eacute;s par des donn&eacute;es RS risquent de ne pas fonctionner avec une source de donn&eacute;es AS</h3>
<p>Le fournisseur OLE DB SQL Server 2008 Analysis Services (AS) remplace sans condition le registre pour qu&#39;il pointe vers lui-m&ecirc;me en tant que dernier fournisseur, qu&#39;il soit ou non le dernier fournisseur install&eacute;. Pour fonctionner, les abonnements pilot&eacute;s par des donn&eacute;es au sein de Reporting Services (RS) ont besoin du fournisseur SQL Server nom de code &laquo; Denali &raquo;. </p>
<p>Office 2010 installe le fournisseur SQL Server 2008. Si Office est install&eacute; apr&egrave;s Denali, le fournisseur SQL Server 2008 se d&eacute;clare comme le dernier m&ecirc;me si ce n&#39;est pas le cas. Si vous tentez de cr&eacute;er ou de modifier un abonnement pilot&eacute; par des donn&eacute;es avec une requ&ecirc;te de remise qui obtient des donn&eacute;es aupr&egrave;s d&#39;Analysis Services &agrave; l&#39;aide de MDX, vous recevez l&#39;erreur suivante :</p>
<p class="style1"><em>&laquo; Impossible de g&eacute;n&eacute;rer le dataset. Une erreur s&#39;est produite lors de la connexion &agrave; une source de donn&eacute;es ou la requ&ecirc;te n&#39;est pas valide pour la source de donn&eacute;es.</em></p>
<p><strong>Solution : </strong>r&eacute;parez la version Denali CTP3 du fournisseur OLE DB Microsoft Analysis Services pour Microsoft SQL Server.</p>
<h3 class="subHeading"><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a><a name="L_nstallation_de_SQL_Server_2008_R2_apr_egrave_s_l_installation_de_SQL_Server_Denali_provoque_des_eacute_checs_d_analyse_dans_le_concepteur_de_requ_ecirc_tes_Reporting_Services"></a>2.3 L&#39;nstallation de SQL Server 2008 R2 apr&egrave;s l&#39;installation de SQL Server Denali provoque des &eacute;checs d&#39;analyse dans le concepteur de requ&ecirc;tes Reporting Services</h3>
<p>Cr&eacute;ez un projet de rapport dans SQL Server Denali. Ajoutez un nouveau dataset &agrave; ce rapport. Ouvrez le concepteur de requ&ecirc;tes et ajoutez une requ&ecirc;te. Vous pouvez obtenir le message d&#39;erreur suivant :</p>
<p class="style1"><em>&quot;&Eacute;chec de la pr&eacute;paration de la requ&ecirc;te. &Eacute;chec de l&#39;analyse de la requ&ecirc;te pour d&eacute;tecter s&#39;il s&#39;agit d&#39;une requ&ecirc;te MDX ou DMX. (MDXQueryGenerator)&quot;</em></p>
<p><strong>Solution : </strong>ce message d&#39;erreur est g&eacute;n&eacute;r&eacute; uniquement si vous installez SQL Server 2008 R2 apr&egrave;s avoir install&eacute; SQL Server Denali. Pour corriger le probl&egrave;me, r&eacute;installez le fournisseur MSOLAP &agrave; l&#39;aide du fournisseur Denali. T&eacute;l&eacute;chargez SQL Server nom de code &laquo; Denali &raquo; CTP3 &agrave; partir de la <a href="http://go.microsoft.com/?linkid=9776822">page du centre de t&eacute;l&eacute;chargement Microsoft</a>.</p>
<h3 class="subHeading"><a name="Les_bases_de_donn_eacute_es_ne_peuvent_pas_ecirc_tre_restaur_eacute_es_agrave_l_aide_de_SSMS_lorsqu_un_serveur_a_des_mod_egrave_les_en_mode_DirectQuery_uniquement"></a>2.4 Les bases de donn&eacute;es ne peuvent pas &ecirc;tre restaur&eacute;es &agrave; l&#39;aide de SSMS lorsqu&#39;un serveur a des mod&egrave;les en mode DirectQuery uniquement</h3>
<p>Vous ne pouvez pas restaurer une base de donn&eacute;es &agrave; l&#39;aide de SQL Server Management Studio (SSMS) lorsque le serveur poss&egrave;de des mod&egrave;les en mode DirectQuery uniquement.</p>
<p>Si vous installez une instance d&#39;Analysis Services ex&eacute;cut&eacute;e en mode VertiPaq, d&eacute;ployez uniquement les mod&egrave;les DirectQuery vers elle, cliquez avec le bouton droit sur une base de donn&eacute;es quelconque, cliquez sur Restore ou Restore from PowerPivot, puis cliquez sur Browse pour rechercher la suite. Le message d&#39;erreur suivant appara&icirc;t alors :</p>
<p class="style1"><em>&quot;Erreur DirectQuery : Les op&eacute;rations MDX/SQL ne sont pas prises en charge en mode DirectQuery.&quot;</em></p>
<p><strong>Solution :</strong> Vous pouvez restaurer la base de donn&eacute;es &agrave; l&#39;aide d&#39;un script XMLA, PowerShell ou AMO. Vous pouvez utiliser SSMS pour r&eacute;tablir les mod&egrave;les DirectQuery s&#39;il existe au moins un mod&egrave;le VertiPaq sur le serveur.</p>
<h3 class="subHeading"><a name="La_cr_eacute_ation_de_partitions_apr_egrave_s_le_d_eacute_ploiement_peut_entra_icirc_ner_l_eacute_chec_du_d_eacute_ploiement_suivant"></a>2.5 La cr&eacute;ation de partitions apr&egrave;s le d&eacute;ploiement peut entra&icirc;ner l&#39;&eacute;chec du d&eacute;ploiement suivant</h3>
<p>Le traitement peut &eacute;chouer apr&egrave;s le red&eacute;ploiement d&#39;un mod&egrave;le avec des requ&ecirc;tes de d&eacute;finition de partition modifi&eacute;es. </p>
<p>Vous pouvez, par exemple, commencer par un mod&egrave;le avec une partition (Partition 1), d&eacute;ployer et traiter ce mod&egrave;le, laisser vos donn&eacute;es inchang&eacute;es et modifier votre d&eacute;finition de partition. Vous d&eacute;finissez ensuite une seconde partition (Partition 2) qui inclut un sous-ensemble du jeu de donn&eacute;es pr&eacute;c&eacute;dent pour la Partition 1, puis d&eacute;ployez et traitez votre mod&egrave;le. Une fois que le mod&egrave;le est d&eacute;ploy&eacute; et trait&eacute; &agrave; l&#39;aide de la commande d&#39;option de traitement par d&eacuement_peut_entra_icirc_ner_l_eacute_chec_du_d_eacute_ploiement_suivant"></a>2.5 La cr&eacute;ation de partitions apr&egrave;s le d&eacute;ploiement peut entra&icirc;ner l&#39;&eacute;chec du d&eacute;ploiement suivant</h3>
<p>Le traitement peut &eacute;chouer apr&egrave;s le red&eacute;ploiement d&#39;un mod&egrave;le avec des requ&ecirc;tes de d&eacute;finition de partition modifi&eacute;es. </p>
<p>Vous pouvez, par exemple, commencer par un mod&egrave;le avec une partition (Partition 1), d&eacute;ployer et traiter ce mod&egrave;le, laisser vos donn&eacutete;faut, le moteur indique qu&#39;il n&#39;est pas n&eacute;cessaire de traiter la Partition 1, dans la mesure o&ugrave; elle contient d&eacute;j&agrave; des donn&eacute;es, et, par cons&eacute;quent, introduit des donn&eacute;es dupliqu&eacute;es dans le mod&egrave;le lors du traitement de la Partition 2.</p>
<p><strong>Solutions :</strong></p>
<ul>
    <li>Avant de red&eacute;ployer votre mod&egrave;le, acc&eacute;dez &agrave; SQL Server Management Studio (SSMS), cliquez avec le bouton droit sur la base de donn&eacute;es, puis cliquez sur <strong>Traiter la base de donn&eacute;es</strong>. S&eacute;lectionnez l&#39;option <strong>Traiter l&#39;effacement</strong> dans la bo&icirc;te de dialogue, puis cliquez sur <strong>OK</strong>. Toutes les donn&eacute;es sont supprim&eacute;es de votre base de donn&eacute;es. Vous pouvez alors effectuer le d&eacute;ploiement et le traitement depuis Business Intelligence Development Studio (BIDS), comme pr&eacute;vu. </li>
    <li>Modifiez le param&egrave;tre de d&eacute;ploiement pour le mod&egrave;le. Cliquez avec le bouton droit sur votre fichier .smproj, puis cliquez sur <strong>Propri&eacute;t&eacute;s</strong>. Faites passer la valeur de la propri&eacute;t&eacute; <strong>Option de traitement</strong> de <strong>Valeur par d&eacute;faut</strong> &agrave; <strong>Ne pas traiter</strong> ou &agrave; <strong>Compl&egrave;te</strong>. </li>
</ul>
<h3 class="subHeading"><a name="Le_volet_des_m_eacute_tadonn_eacute_es_dans_SSMS_est_vide_lorsque_vous_parcourez_une_base_de_donn_eacute_es_AS"></a>2.6 Le volet des m&eacute;tadonn&eacute;es dans SSMS est vide lorsque vous parcourez une base de donn&eacute;es AS</h3>
<p>Le volet des m&eacute;tadonn&eacute;es est vide lorsque vous parcourez une base de donn&eacute;es Analysis Services (AS) dans SQL Server Management Studio (SSMS).</p>
<p>Par exemple, si vous ouvrez SSMS, connectez-vous &agrave; un serveur AS, cliquez avec le bouton droit sur une base de donn&eacute;es, puis cliquez sur <strong>Parcourir</strong> ; le volet des m&eacute;tadonn&eacute;es dans l&#39;explorateur de cube est vide. </p>
<p><strong>Solution :</strong> Redimensionnez le volet des m&eacute;tadonn&eacute;es ou passez du mode Cr&eacute;ation au mode Texte. Les m&eacute;tadonn&eacute;es du mod&egrave;le s&#39;affichent et vous pouvez les faire glisser dans l&#39;explorateur de cube.</p>
<h3 class="subHeading"><a name="Difficult_eacute_de_navigation_dans_les_mod_egrave_les_de_grande_dimension"></a>2.7 Difficult&eacute; de navigation dans les mod&egrave;les de grande dimension</h3>
<p>En mod&eacute;lisation tubulaire, lorsque vous travaillez avec un mod&egrave;le comportant de nombreux tableaux, les onglets des tableaux permettent &agrave; pr&eacute;sent de les faire d&eacute;filer comme dans Excel. La navigation dans les tableaux est difficile lorsqu&#39;il y en a plus de 10.</p>
<p><strong>Solutions :</strong></p>
<ul>
    <li>Vous pouvez faire glisser un tableau de la liste et placez l&#39;onglet o&ugrave; bon vous semble, de mani&egrave;re &agrave; acc&eacute;der plus facilement &agrave; des onglets particuliers. </li>
    <li>Vous pouvez modifier l&#39;ordre et la position des onglets existants. </li>
</ul>
<a name="Analysis_Services2">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Les_composants_SSIS_des_mod_egrave_les_tabulaires_AS_ne_fonctionnent_pas_comme_pr_eacute_vu"></a>2.8 Les composants SSIS des mod&egrave;les tabulaires AS ne fonctionnent pas comme pr&eacute;vu</h3>
<p>Les composants SQL Server Integration Services (SSIS) pour Analysis Services (AS) ne fonctionnent pas comme pr&eacute;vu pour les mod&egrave;les tabulaires.</p>
<p>Il existe un certain nombre de probl&egrave;mes connus lorsque vous essayez d&#39;&eacute;crire un paquet SSIS pour travailler avec des mod&egrave;les tabulaires :</p>
<ul>
    <li>Le gestionnaire de connexions AS ne peut pas utiliser de mod&egrave;le tabulaire dans la m&ecirc;me solution que la source de donn&eacute;es. Vous devez explicitement vous connecter au serveur AS avant de configurer la t&acirc;che de traitement AS ou la t&acirc;che d&#39;ex&eacute;cution DDL d&#39;AS. </li>
    <li>Il existe un certain nombre de probl&egrave;mes avec la t&acirc;che de traitement AS lorsque vous travaillez avec des mod&egrave;les tabulaires :
    <ul>
        <li>&Agrave; la place des bases de donn&eacute;es, tableaux et partitions, figurent des cubes, des groupes de mesures et des dimensions. Il s&#39;agit d&#39;une limitation de la t&acirc;che. Vous pouvez toujours traiter votre mod&egrave;le tabulaire &agrave; l&#39;aide de la structure cube/groupe de mesures/dimension. </li>
        <li>Certaines options de traitement prises en charge par AS en mode VertiPaq ne sont pas disponibles dans la t&acirc;che de traitement AS, telle que Traiter la d&eacute;fragmentation. <br />
        <br />
        <strong>Solution :</strong> utilisez &agrave; la place la t&acirc;che d&#39;ex&eacute;cution DDL Analysis Services pour ex&eacute;cuter un script XMLA qui contient la commande ProcessDefrag.<br />
        <br />
        </li>
        <li>Certaines options de configuration de l&#39;outil ne sont pas applicables. Par exemple, l&#39;option Traiter les objets connexes ne doit pas &ecirc;tre utilis&eacute;e lors du traitement des partitions, et l&#39;option de configuration Traitement parall&egrave;le contient un message d&#39;erreur non valide mentionnant que le traitement parall&egrave;le n&#39;est pas pris en charge sur la r&eacute;f&eacute;rence standard. </li>
    </ul>
    </li>
</ul>
<a name="Analysis_Services10">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Un_mod_egrave_le_ne_peut_pas_ecirc_tre_d_eacute_ploy_eacute_si_vous_avez_pr_eacute_alablement_exclu_le_fichier_BIM_du_projet_de_mod_egrave_le_tabulaire"></a>2.9 Un mod&egrave;le ne peut pas &ecirc;tre d&eacute;ploy&eacute; si vous avez pr&eacute;alablement exclu le fichier BIM du projet de mod&egrave;le tabulaire</h3>
<p>Vous ne pouvez pas d&eacute;ployer un mod&egrave;le si vous avez pr&eacute;alablement exclu le fichier .bim du projet de mod&egrave;le tabulaire. </p>
<p>Par exemple, vous pouvez ouvrir un projet de mod&egrave;le tabulaire, afficher la fen&ecirc;tre Explorateur de solutions, v&eacute;rifier que l&#39;optin <strong>Afficher tous les fichiers</strong> est s&eacute;lectionn&eacute;e, cliquer avec le bouton droit sur le fichier .bim dans l&#39;Explorateur de solutions, cliquer sur <strong>Exclure du projet</strong>, cliquer avec le bouton droit sur le fichier .bim dans l&#39;Explorateur de solutions, cliquer sur <strong>Inclure dans le projet</strong> et d&eacute;ployer le projet. </p>
<p>Le build &eacute;choue et l&#39;erreur suivante appara&icirc;t dans la liste d&#39;erreurs : </p>
<p class="od_egrave_le_tabulaire"></a>2.9 Un mod&egrave;le ne peut pas &ecirc;tre d&eacute;ploy&eacute; si vous avez pr&eacute;alablement exclu le fichier BIstyle1"><em>&quot;&laquo; Erreur 1 Impossible de cr&eacute;er des projets qui contiennent plusieurs fichiers BIM C:\Program Files (x86)\MSBuild\Business Intelligence Semantic Model\1.0\Microsoft.AnalysisServices.VSHostBuilder.targets 71 8 TabularProject7</em> </p>
<p><strong>Solution : </strong>Excluez de nouveau le fichier du projet. Pour l&#39;ajouter de nouveau au projet, cliquez avec le bouton droit sur le fichier du projet dans l&#39;Explorateur de solutions, cliquez sur <strong>Ajouter</strong> <strong>un &eacute;l&eacute;ment existant</strong>, puis cliquez sur le fichier .bim qui &eacute;tait exclu.</p>
<a name="Analysis_Services15">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Impossible_de_modifier_la_connexion_dans_SSMS_pour_certains_types_de_connexion_dans_les_mod_egrave_les_tubulaires"></a>2.10 Impossible de modifier la connexion dans SSMS pour certains types de connexion dans les mod&egrave;les tubulaires</h3>
<p>Dans la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de connexion de SQL Server Management Studio (SSMS) pour les mod&egrave;les tubulaires, le Gestionnaire de connexions affiche le mauvais fournisseur pour certains types de connexions, comme les flux de donn&eacute;es. </p>
<p><strong>Solution :</strong> entrez manuellement la cha&icirc;ne de connexion dans la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de connexion plut&ocirc;t qu&#39;utiliser le Gestionnaire de connexions.</p>
<h3 class="subHeading"><a name="Le_filtrage_de_membres_des_diff_eacute_rents_niveaux_d_une_hi_eacute_rarchie_entra_icirc_ne_une_erreur"></a>2.11 Le filtrage de membres des diff&eacute;rents niveaux d&#39;une hi&eacute;rarchie entra&icirc;ne une erreur</h3>
<p>Si SQL Server Analysis Services est install&eacute; en mode tabulaire, les requ&ecirc;tes DAX (Data Analysis Expressions) et MDX (Multidimensional Expressions) sur le mod&egrave;le tubulaire qui impliquent des formes arbitraires avec une granularit&eacute; mixte &eacute;choueront avec un message d&#39;erreur indiquant que ce type de requ&ecirc;te n&#39;est pas pris en charge en mode VertiPaq. L&#39;erreur suivante appara&icirc;t dans le tableau crois&eacute; dynamique :</p>
<p class="style1"><em>&laquo; La requ&ecirc;te requiert la g&eacute;n&eacute;ration d&#39;une demande de donn&eacute;es impliquant un secteur constitu&eacute; d&#39;un ensemble de forme arbitraire avec des tuples de diff&eacute;rents niveaux de hi&eacute;rarchie, ce qui n&#39;est pas pris en charge lors de l&#39;utilisation d&#39;Analysis Services en mode VertiPaq. &raquo;</em></p>
<h3 class="subHeading">2.12 <span style="color:#ffffff;text-decoration:none;"><a name="Analysis_Services13">L&#39;installation de BIDS n&#39;arrive pas &agrave; t&eacute;l&eacute;charger le package VSTS</a></span></h3>
<a name="Analysis_Services9">

<div id="h9">
<div id="d9" class="style12">
<p>Si vous installez et ouvrez Business Intelligence Development Studio (BIDS), puis cr&eacute;ez un nouveau projet Analysis Services, Reporting Services ou Integration Services, le message d&#39;erreur suivant s&#39;affiche :</p>
<p class="style1"><em>&quot;&#39;Le package VSTS pour les applications de la couche Donn&eacute;es Database Professionals SQL Server n&#39;a pas pu &ecirc;tre t&eacute;l&eacute;charg&eacute; correctement&quot;</em></p>
<p>Vous pouvez ignorer ce message si vous souhaitez travailler avec Analysis Services, Reporting Services ou Integration Services. </p>
<p><strong>Solution :</strong> pour travailler avec les applications de donn&eacute;es, installez Project Juneau apr&egrave;s avoir install&eacute; BIDS.</p>
</div>
</div>
</a>
<div id="h9">
<div id="d9" class="style12"></div>
</div>
<h3 class="subHeading"><a name="BIDS_ne_r_eacute_pond_plus_lorsque_vous_copiez_une_grande_quantit_eacute_de_donn_eacute_es_dans_le_Presse-papiers"></a>2.13 BIDS ne r&eacute;pond plus lorsque vous copiez une grande quantit&eacute; de donn&eacute;es dans le Presse-papiers</h3>
<p>Si vous copiez une grande quantit&eacute; de donn&eacute;es dans le Presse-papiers ou s&eacute;lectionnez de nombreuses colonnes et lignes dans un projet de mod&egrave;le tabulaire, Business Intelligence Development Studio (BIDS) cesse de r&eacute;pondre.</p>
<p><strong>Solution : </strong>copiez uniquement de petits jeux de donn&eacute;es &agrave; partir du projet tabulaire.</p>
<h3 class="subHeading"><a name="Le_remplacement_d_une_base_de_donn_eacute_es_lors_d_une_restauration_PowerPivot_n_est_pas_pris_en_charge"></a>2.14 Le remplacement d&#39;une base de donn&eacute;es lors d&#39;une restauration PowerPivot n&#39;est pas pris en charge</h3>
<p>Dans la bo&icirc;te de dialogue <strong>Restaurer &agrave; partir de PowerPivot</strong>, rep&eacute;rez la case &agrave; cocher <strong>Remplacer la base de donn&eacute;es</strong>. Le remplacement d&#39;une base de donn&eacute;es lors de la restauration d&#39;un classeur PowerPivot n&#39;est pas prise en charge pour la version SQL Server nom de code &laquo; Denali &raquo; CTP3 de PowerPivot. </p>
<a name="Analysis_Services14">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Impossible_d_utiliser_une_colonne_calcul_eacute_e_pour_marquer_une_table_comme_table_de_dates"></a>2.15 Impossible d&#39;utiliser une colonne calcul&eacute;e pour marquer une table comme table de dates </h3>
<p>Dans Business Intelligence Development Studio (BIDS), vous ne pouvez pas utiliser les colonnes calcul&eacute;es pour marquer une table en tant que table de dates. Par exemple, si vous ajoutez une colonne calcul&eacute;e, cliquez sur le bouton Marquer en tant que table de dates et s&eacute;lectionnez la colonne calcul&eacute;e, vous recevez l&#39;erreur suivante :</p>
<p class="style1"><em>&quot;&laquo; La colonne calcul&eacute;e &laquo; Table[CalculatedColumn1] &raquo; ne peut pas &ecirc;tre utilis&eacute;e comme cl&eacute; primaire de la table. &raquo; </em></p>
<a name="Analysis_Services16">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="La_bo_icirc_te_de_dialogue_Nouvel_eacute_l_eacute_ment_dans_BIDS_n_inclut_pas_le_mod_egrave_le_d_eacute_l_eacute_ment_BIM"></a>2.16 La bo&icirc;te de dialogue Nouvel &eacute;l&eacute;ment dans BIDS n&#39;inclut pas le mod&egrave;le d&#39;&eacute;l&eacute;ment BIM</h3>
<p>Dans Business Intelligence Development Studio (BIDS), vous pouvez afficher l&#39;Explorateur de solutions, cliquer avec le bouton droit de la souris sur un projet de mod&egrave;le tabulaire vide, puis cliquer sur <strong>Ajouter un nouvel &eacute;l&eacute;ment</strong>. La bo&icirc;te de dialogue Nouvel &eacute;l&eacute;ment est vide et vous ne pouvez pas ajouter un nouveau fichier BIM</p>
<p><strong>Solution</strong></p>
<p><strong>: </strong>cr&eacute;ez un nouveau projet. Afficher la bo&icirc;te de dialogue <strong>Ajouter un &eacute;l&eacute;ment existant</strong> pour ajouter un fichier existant au projet actif</p>
<p><a>[Haut]</a></p>
<a name="Books_Online">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Documentation_en_ligne"></a>3.0 Documentation en ligne</h1>
<a name="Books_Online0">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="La_visionneuse_de_l_aide_pour_SQL_Server_se_bloque_dans_les_environnements_configur_eacute_s_pour_ex_eacute_cuter_uniquement_IPv6"></a>3.1 La visionneuse de l&#39;aide pour SQL Server se bloque dans les environnements configur&eacute;s pour ex&eacute;cuter uniquement IPv6</h3>
<div class="subsection">
<p>Si votre environnement est configur&eacute; pour ex&eacute;cuter uniquement IPv6, la visionneuse de l&#39;aide pour SQL Server nom de code &laquo; Denali &raquo; se bloquera et vous obtiendrez le message d&#39;erreur suivant :</p>
<p class="style1"><em>HelpLibAgent.exe a cess&eacute; de fonctionner.</em></p>
<p><strong>Solution : </strong>pour r&eacute;soudre ce probl&egrave;me, activez IPv4 ou suivez les &eacute;tapes qui suivent pour ajouter une entr&eacute;e de Registre et cr&eacute;er une liste de contr&ocirc;le d&#39;acc&egrave;s (ACL) afin d&#39;activer IPv6 pour la visionneuse de l&#39;aide :</p>
<ol>
    <li>
    <p class="style3">Cr&eacute;ez une cl&eacute; de registre ayant pour nom &laquo; IPv6 &raquo; et pour valeur &laquo; 1 (DWORD(32 bit)) &raquo; sous <i>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Help\v1.0.</i></p>
    </li>
    <li>
    <p class="style3">D&eacute;finissez l&#39;ACL de s&eacute;curit&eacute; pour le port d&#39;IPv6, en ex&eacute;cutant la commande qui suit &agrave; partir d&#39;une fen&ecirc;tre CMD d&#39;administration </p>
    </li>
</ol>
<p class="style4"><em>netsh http add urlacl url=http://[::1]:47873/help/ sddl=D:(A;;GX;;;WD).</em></p>
</div>
<div class="subsection"><a name="Database_Engine7">
<div class="alert">
<table cellspacing="0" cellpadding="0" width="100%">
    <tbody>
        <tr>
            <th align="left"><b>Remarque</b></th>
        </tr>
        <tr>
            <td>
            <p>Cela s&#39;applique &agrave; tous les environnements qui s&#39;ex&eacute;cutent uniquement avec IPv6. Les environnements activ&eacute;s pour IPv4 (et IPv4 avec IPv6) ne sont pas concern&eacute;s.</p>
            </td>
        </tr>
    </tbody>
</table>
</div>
</a></div>
<div>
<div class="subsection">
<p><a>[Haut]</a></p>
</div>
</div>
<a name="Data_Quality_Services">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Data_Quality_Services"></a>4.0 Data Quality Services</h1>
<div>
<h3 class="subHeading">ave; partir d&#39;une fen&ecirc;tre CMD d&#39;administration </p>
    </li>
</ol>
<p class="style4"><em>netsh http add urlacl url=http://[::1]:47873/help/ sddl=D:(A;;GX;;;WD).</em></p>
</div>
<div class="subsection"><a name="Database_Engine7">
<div class="alert">
<table cellspacing="0" cellpadding="0" width="100%">
    <tbody>
        <tr>
            <th align="left"><b>Remarque</b></th>
        </tr>
        <tr>
            <td>
            <p>Cela<a name="Pour_r_eacute_installer_le_serveur_DQS_supprimez_les_objets_DQS_apr_egrave_s_avoir_d_eacute_sinstall_eacute_le_serveur_DQS"></a>4.1 Pour r&eacute;installer le serveur DQS, supprimez les objets DQS apr&egrave;s avoir d&eacute;sinstall&eacute; le serveur DQS</h3>
<div class="subsection">
<p>Si vous d&eacute;sinstallez le serveur Data Quality Services (DQS), les objets DQS (bases de donn&eacute;es DQS, connexions DQS et une proc&eacute;dure stock&eacute;e DQS) ne sont pas supprim&eacute;s de l&#39;instance SQL Server.</p>
<p><strong>Solution : </strong>Pour r&eacute;installer le serveur DQS sur le m&ecirc;me ordinateur et dans la m&ecirc;me instance SQL Server, vous devez supprimer manuellement les objets DQS de l&#39;instance SQL Server. Par ailleurs, vous devez &eacute;galement supprimer les fichiers de bases de donn&eacute;es DQS (DQS_MAIN et DQS_PROJECTS) du dossier C:\Program Files\Microsoft SQL Server\MSSQL11.&lt;SQL_Server_Instance&gt;\MSSQL\DATA de votre ordinateur avant de r&eacute;installer le serveur DQS. &Agrave; d&eacute;faut, l&#39;installation du serveur DQS &eacute;choue. D&eacute;placez les fichiers de base de donn&eacute;es au lieu de les supprimer si vous souhaitez conserver des donn&eacute;es, telles que les bases de connaissances ou les projets de qualit&eacute; des donn&eacute;es. Pour plus d&#39;informations sur la suppression des objets DQS une fois la d&eacute;sinstallation termin&eacute;e, reportez-vous &agrave; </p>
</div>
</div>
<div>
<div class="subsection">
<p>la rubrique &laquo; Supprimer les objets Data Quality Services &raquo; du guide d&#39;installation DQS.</p>
<a name="Data_Quality_Services0">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Indication_d_une_d_eacute_couverte_de_connaissances_termin_eacute_e_ou_retard_d_une_activit_eacute_de_nettoyage_interactif"></a>4.2 Indication d&#39;une d&eacute;couverte de connaissances termin&eacute;e ou retard d&#39;une activit&eacute; de nettoyage interactif</h3>
<div class="subsection">
<p>Si un administrateur met fin &agrave; une activit&eacute; dans l&#39;&eacute;cran Analyse des activit&eacute;s, un utilisateur interactif ex&eacute;cutant la d&eacute;couverte des connaissances, la gestion de domaine ou une activit&eacute; de nettoyage interactif ne recevra aucune indication selon laquelle son activit&eacute; est termin&eacute;e tant qu&#39;il n&#39;aura pas effectu&eacute; l&#39;op&eacute;ration suivante.</p>
<h3 class="subHeading"><a name="Lorsqu_une_base_de_connaissances_est_verrouill_eacute_e_une_activit_eacute_de_gestion_des_connaissances_ne_peut_pas_ecirc_tre_ouverte"></a>4.3 Lorsqu&#39;une base de connaissances est verrouill&eacute;e, une activit&eacute; de gestion des connaissances ne peut pas &ecirc;tre ouverte</h3>
<div class="subsection">
<p>Si une base de connaissances est verrouill&eacute;e, vous devez &ecirc;tre en mesure d&#39;ouvrir une activit&eacute; de d&eacute;couverte des connaissances ou de gestion de domaine en lecture seule. Toutefois, dans CTP3, si une base de connaissances est verrouill&eacute;e, les activit&eacute;s de d&eacute;couverte des connaissances et de gestion de domaine ne sont pas disponibles.</p>
</div>
<h3 class="subHeading"><a name="La_fin_d_une_activit_eacute_pendant_que_l_arr_ecirc_t_est_en_cours_peut_eacute_chouer"></a>4.4 La fin d&#39;une activit&eacute; pendant que l&#39;arr&ecirc;t est en cours peut &eacute;chouer</h3>
<div class="subsection">
<p>Si une activit&eacute; de d&eacute;couverte des connaissances ou de gestion de domaine est termin&eacute;e sur l&#39;&eacute;cran Analyse des activit&eacute;s alors qu&#39;une op&eacute;ration de fin est en cours pour ladite activit&eacute;, une exception est envoy&eacute;e. </p>
<p><strong>Solution :</strong> Pour &eacute;viter ce probl&egrave;me, ne mettez pas fin &agrave; une activit&eacute; de d&eacute;couverte des connaissances ou de gestion de domaine pendant que l&#39;op&eacute;ration de fin est en cours.</p>
</div>
<h3 class="subHeading"><a name="La_connexion_de_donn_eacute_es_eacute_chouera_si_MS_dqs_db_owner_login_et_MS_dqs_service_login_ne_sont_pas_des_utilisateurs_de_la_base_de_donn_eacute_es_ou_si_les_donn_eacute_es_ne_se_trouvent_pas_dans_une_base_de_donn_eacute_es_DQS"></a>4.5 La connexion de donn&eacute;es &eacute;chouera si ##MS_dqs_db_owner_login## et ##MS_dqs_service_login## ne sont pas des utilisateurs de la base de donn&eacute;es ou si les donn&eacute;es ne se trouvent pas dans une base de donn&eacute;es DQS</h3>
<div class="subsection">
<p>Pour qu&#39;une connexion &agrave; une source de donn&eacute;es fonctionne, l&#39;utilisateur doit d&eacute;finir la connexion SQL de ##MS_dqs_db_owner_login## et de ##MS_dqs_service_login## en tant qu&#39;utilisateur de la base de donn&eacute;es, et la base de donn&eacute;es doit &ecirc;tre dans la m&ecirc;me instance SQL que les bases de donn&eacute;es DQS. Cela se v&eacute;rifie si l&#39;utilisateur dispose d&#39;un acc&egrave;s complet &agrave; la source de donn&eacute;es. </p>
<p>Pour plus d&#39;informations, reportez-vous &agrave; la rubrique &laquo; Accorder l&#39;acc&egrave;s aux donn&eacute;es pour les op&eacute;rations Data Quality Services &raquo; du guide d&#39;installation DQS.</p>
</div>
<h3 class="subHeading"><a name="Les_dates_ant_eacute_rieures_agrave_1753_entra_icirc_nent_l_eacute_chec_de_DQS"></a>4.6 Les dates ant&eacute;rieures &agrave; 1753 entra&icirc;nent l&#39;&eacute;chec de DQS</h3>
<div class="subsection">
<p>Si une activit&eacute; de d&eacute;couverte des connaissances est ex&eacute;cut&eacute;e sur une valeur d&#39;un champ de date contenant des dates ant&eacute;rieures au 1-1-1753, le traitement &eacute;choue. </p>
<p><strong>Solution :</strong> Pour &eacute;viter ce probl&egrave;me, excluez ces dates ou utilisez le type de donn&eacute;es <em>datetime</em>.</p>
</div>
<h3 class="subHeading"><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a><a name="Les_ong> Pour &eacute;viter ce probl&egrave;me, excluez ces dates ou utilisez le type de donn&eacute;es <em>datetime</em>.</p>
</div>
<h3 class="subHeading"><a name="Les_valeurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_cvaleurs_contenant_plus_de_450_caract_egrave_res_entra_icirc_nent_l_eacute_chec_de_DQS"></a>4.7 Les valeurs contenant plus de 450 caract&egrave;res entra&icirc;nent l&#39;&eacute;chec de DQS</h3>
<div class="subsection">
<p>Si une correction de donn&eacute;es est effectu&eacute;e sur une table source contenant des valeurs de plus de 450 caract&egrave;res, le traitement &eacute;choue. Cela se produit avec une colonne de type nvarchar(MAX) ou varchar(MAX) dans la table source, et lorsque le domaine de cha&icirc;ne est configur&eacute; pour s&eacute;parer les valeurs de domaine en termes, au lieu d&#39;analyser le texte comme une simple valeur. </p>
<p><strong>Solution :</strong> Pour &eacute;viter ce probl&egrave;me, excluez ces valeurs.</p>
</div>
<h3 class="subHeading"><a name="Une_op_eacute_ration_d_annulation_peut_entra_icirc_ner_l_abandon_de_plusieurs_activit_eacute_s"></a>4.8 Une op&eacute;ration d&#39;annulation peut entra&icirc;ner l&#39;abandon de plusieurs activit&eacute;s</h3>
<div class="subsection">
<p>Si vous cliquez sur <strong>Annuler</strong> pour une activit&eacute; de d&eacute;couverte des connaissances ou de gestion de domaine en cours d&#39;ex&eacute;cution et si d&#39;autres activit&eacute;s ont &eacute;t&eacute; termin&eacute;es pr&eacute;c&eacute;demment sans publication pendant l&#39;ex&eacute;cution de l&#39;activit&eacute;, le travail effectu&eacute; par toutes les activit&eacute;s depuis la derni&egrave;re publication sera abandonn&eacute;, pas uniquement pour le travail en cours. </p>
<p><strong>Solution :</strong> Pour &eacute;viter ce probl&egrave;me, publiez le travail que vous souhaitez conserver dans la base de connaissances avant de d&eacute;marrer une nouvelle activit&eacute;. </p>
</div>
</div>
<div class="subsection">
<div class="subsection"></div>
<div class="subsection">
<div class="subsection">
<div class="subsection">
<div class="subsection">
<h3 class="subHeading"><a name="L_application_cliente_DQS_ne_r_eacute_pond_plus_avec_des_exemples_volumineux"></a>4.9 L&#39;application cliente DQS ne r&eacute;pond plus avec des exemples volumineux</h3>
<div class="subsection">
<p>Lorsque le processus de d&eacute;couverte des connaissances est ex&eacute;cut&eacute; avec au moins 15 000 enregistrements, l&#39;application cliente ne r&eacute;pond plus. Cela est provoqu&eacute; par un bogue donnant lieu &agrave; une erreur dans les cas o&ugrave; une requ&ecirc;te est ex&eacute;cut&eacute;e via SQLCLR et o&ugrave; un haut niveau de parall&eacute;lisme est requis.</p>
</div>
<p><strong>Solution : </strong>Pour &eacute;viter ce probl&egrave;me, ex&eacute;cutez le script suivant dans SSMS, puis red&eacute;marrez SQL Server :</p>
<p class="style20"><span class="style19">sp_configure &#39;show advanced options&#39;, 1; </span></p>
<p class="style1">GO</p>
<p class="style1">RECONFIGURE WITH OVERRIDE;</p>
<p class="style1">GO</p>
<p class="style1">sp_configure &#39;max degree of parallelism&#39;, 1;</p>
<p class="style1">GO</p>
<p class="style1">RECONFIGURE WITH OVERRIDE;</p>
<p class="style1">GO</p>
<p>Lorsque vous ex&eacute;cutez ce script, l&#39;instance utilise uniquement une unit&eacute; centrale pour toutes les requ&ecirc;tes ex&eacute;cut&eacute;es.</p>
<h3 class="subHeading"><a name="Erreur_lors_de_l_importation_des_bases_de_connaissances_des_domaines_ou_des_valeurs_de_domaine"></a>4.10 Erreur lors de l&#39;importation des bases de connaissances, des domaines ou des valeurs de domaine</h3>
<div class="subsection">
<p>Pendant l&#39;importation d&#39;une base de connaissances, d&#39;un domaine ou de valeurs de domaine, une erreur peut se produire lorsque vous cliquez sur <strong>Parcourir</strong> pour s&eacute;lectionner le fichier &agrave; importer. Le dernier emplacement de dossier parcouru pour l&#39;op&eacute;ration d&#39;importation est enregistr&eacute; dans le registre (cl&eacute; R&eacute;pertoire initial), et DQS ouvre le m&ecirc;me emplacement de dossier lorsque vous cliquez sur <strong>Parcourir</strong>. Cette erreur se produit si le dernier emplacement de dossier enregistr&eacute; n&#39;est pas disponible car le dossier cible a &eacute;t&eacute; renomm&eacute;, d&eacute;plac&eacute; ou supprim&eacute;.</p>
<p><strong>Solution : </strong>Pour r&eacute;soudre ce probl&egrave;me, vous devez supprimer la cl&eacute; R&eacute;pertoire initial dans le dossier HKEY_CURRENT_USER\Software\Microsoft\Microsoft SQL Server\110\Tools\DQ\Studio\Configurations\Dialogs du registre.</p>
<h3 class="subHeading"><a name="DQSInstaller_eacute_choue_si_un_red_eacute_marrage_est_en_attente_en_raison_de_mises_agrave_jour_de_NET_Framework_4"></a>4.11 DQSInstaller &eacute;choue si un red&eacute;marrage est en attente en raison de mises &agrave; jour de .NET Framework 4</h3>
<div class="subsection">
<p>Si vous essayez d&#39;ex&eacute;cuter DQSInstaller.exe sur un ordinateur sur lequel un red&eacute;marrage est en attente en raison de l&#39;installation d&#39;une mise &agrave; jour pour .NET Framework 4, l&#39;installation &eacute;choue avec le message suivant :</p>
<p class="style1"><em>&ldquo;Impossible de cr&eacute;er AppDomain &ldquo;DQS_MAIN.dbo[ddl].62&rdquo;.&rdquo;</em></p>
<p><strong>Solution : </strong>pour continuer, red&eacute;marrez votre ordinateur et ex&eacute;cutez de nouveau DQSInstaller.exe.</p>
</div>
<div class="subsection"></div>
<h3 class="subHeading"><a name="Les_modifications_de_la_configuration_DQS_ne_n_eacute_cessitent_pas_le_red_eacute_marrage_de_SQL_Server"></a>4.12 Les modifications de la configuration DQS ne n&eacute;cessitent pas le red&eacute;marrage de SQL Server</h3>
<div class="subsection">
<p>Dans la version actuelle de DQS, vous n&#39;&ecirc;tes plus oblig&eacute; de red&eacute;marrer SQL Server apr&egrave;s modification de la configuration de journalisation du serveur DQS pour que les nouveaux param&egrave;tres soient effectifs. Vous devez, &agrave; la place, ex&eacute;cuter les instructions Transact-SQL apr&egrave;s avoir modifi&eacute; la configuration de journalisation du serveur DQS pour que les nouveaux param&egrave;tres soient applicables :</p>
<p class="style1"><span style="line-height:115%;font-family:courier new;font-size:9pt;">USE [DQS_MAIN]</span></p>
<p class="style1"><span style="line-height:115%;font-family:courier new;font-size:9pt;">GO</span></p>
<p class="style1"><span style="line-height:115%;font-family:courier new;font-size:9pt;">DECLARE @return_value int</span></p>
<p class="style1"><span style="line-height:115%;font-family:courier new;font-size:9pt;">EXEC @return_value = [internal_core].[RefreshLogSettings]</span></p>
<p class="style1"><span style="line-height:115%;font-family:courier new;font-size:9pt;">SELECT &#39;Return Value&#39; = @return_value</span></p>
<p class="style1"><span style="line-height:115%;font-family:courier new;font-size:9pt;">GO</span></p>
<p>Pour plus d&#39;informations sur les param&egrave;tres de journal DQS, reportez-vous &agrave; la rubrique &laquo; Gestion des fichiers journaux DQS &raquo; du guide d&#39;installation DQS.</p>
</div>
<div class="subsection"></div>
<h3 class="subHeading"><a name="Les_bases_de_donn_eacute_es_d_eacute_tenues_par_l_administrateur_syst_egrave_me_SQL_Server_ne_sont_pas_disponibles_pour_les_op_eacute_rations_DQS"></a>4.13 Les bases de donn&eacute;es d&eacute;tenues par l&#39;administrateur syst&egrave;me SQL Server ne sont pas disponibles pour les op&eacute;rations DQS</h3>
<div class="subsection">
<p>Si une base de donn&eacute;es est d&eacute;tenue par un administrateur syst&egrave;me SQL Server, elle n&#39;est pas accessible dans DQS. Pour r&eacute;soudre ce probl&egrave;me, changez le propri&eacute;taire de la base de donn&eacute;es, et faites une nouvelle tentative. Pour plus d&#39;informations sur la modification du propri&eacute;taire d&#39;une base de donn&eacute;es, consultez <a href="http://go.microsoft.com/?linkid=9776343">Modification du propri&eacute;taire de la base de donn&eacute;es</a>.</p>
<h3 class="subHeading"><a name="Les_contr_ocirc_les_ne_sont_pas_mis_agrave_l_eacute_chelle_correctement_dans_la_base_de_connaissances"></a>4.14 Les contr&ocirc;les ne sont pas mis &agrave; l&#39;&eacute;chelle correctement dans la base de connaissances</h3>
<div class="subsection">
<p>Si vous agrandissez la taille du texte de 150 % ou plus (dans Windows Server 2008 ou Windows 7) ou si vous changez le param&egrave;tre d&#39;&eacute;chelle personnals&eacute;e &agrave; 200 % (dans Windows 7), les boutons Annuler et Cr&eacute;er de la Base de connaissances ne sont plus accessibles.</p>
</div>
<h3 class="subHeading"><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a><a name="La_r_eacute_solution_d_eacute_cran_800x600_n_est_pas_prise_en_charge"></a>4.15 La r&eacute;solution d&#39;&eacute;cran 800x600 n&#39;est pas prise en charge</h3>
<div class="subsection">
<p>L&#39;application cliente DQS ne s&#39;affiche pas correctement si la r&eacute;solution d&#39;&eacute;cran est d&eacute;finie sur 800x600. </p>
<p><strong>Solution :</strong> pour r&eacute;soudre ce probl&egrave;me, attribuez &agrave; la r&eacute;solution d&#39;&eacute;cran une valeur plus &eacute;lev&eacute;e.</p>
<h3 class="subHeading"><a name="R_eacute_sultats_de_nettoyage_incorrects_pour_les_valeur_ayant_des_relations_agrave_base_de_termes"></a>4.16 R&eacute;sultats de nettoyage incorrects pour les valeur ayant des relations &agrave; base de termes</h3>
<div class="subsection">
<p>Si vous d&eacute;finissez une relation &agrave; base de termes pour une valeur dans un domaine, et les donn&eacute;es source qui doivent &ecirc;tre nettoy&eacute;es contiennent des valeurs correctes telles que d&eacute;finies dans la relation &agrave; base de termes pour la valeur, les r&eacute;sultats du nettoyage (pour les donn&eacute;es d&#39;aper&ccedil;u comme pour les donn&eacute;es export&eacute;es) sont affect&eacute;s comme suit :</p>
<ul>
    <li>
    <p>Le client DQS contient des donn&eacute;es incorrectes dans la colonne <b>Source</b> et un &eacute;tat incorrect dans la colonne <b>&Eacute;tat</b>. </p>
    </li>
    <li>
    <p>Le composant de correction des donn&eacute;es SQL Server Integration Services contient un &eacute;tat incorrect dans la colonne <b>&Eacute;tat</b>.</p>
    </li>
</ul>
<p>Par exemple, vous pouvez d&eacute;finir une relation &agrave; base de termes pour un domaine nomm&eacute; <b>Nom de l&#39;entreprise</b> et sp&eacute;cifier que &laquo; Inc. &raquo; doit &ecirc;tre remplac&eacute; par &laquo; Incorporated &raquo;. Si l&#39;une des noms d&#39;entreprise dans les donn&eacute;es source contient d&eacute;j&agrave; le terme &laquo; Incorporated &raquo;, par exemple, &laquo; ABC Incorporated &raquo;, les r&eacute;sultats du nettoyage sont affect&eacute;s comme suit :</p>
<ul>
    <li>
    <p>Le client DQS affiche incorrectement &laquo; ABC Inc. &raquo; dans la colonne <b>Source</b> au lieu de &laquo; ABC Incorporated &raquo; et indique &laquo; Corrig&eacute; &raquo; dans la colonne <b>&Eacute;tat</b>. L&#39;activit&eacute; de nettoyage n&#39;a pas chang&eacute; les donn&eacute;es dans la colonne source parce qu&#39;elles &eacute;taient d&eacute;j&agrave; corrig&eacute;es par la relation &agrave; base de termes, et &laquo; Correct &raquo; devrait appara&icirc;tre dans la colonne <b>&Eacute;tat</b>. </p>
    </li>
    <li>
    <p>Le composant de correction des donn&eacute;es SQL Server Integration Services affiche incorrectement &laquo; Corrig&eacute; &raquo; au lieu de &laquo; Correct &raquo; dans la colonne <b>&Eacute;tat</b>. Toutefois, la colonne source affiche correctement les donn&eacute;es d&#39;origine (&laquo; ABC Incorporated &raquo;).</p>
    </li>
</ul>
La colonne <b>R&eacute;sultat</b> dans les r&eacute;sultats de nettoyage du client DQS comme de SQL Server Integration Services, affiche correctement les donn&eacute;es d&#39;origine (&laquo; ABC Incorporated &raquo;).
<h3 class="subHeading"><a name="Mapper_la_colonne_Bigint_dans_les_donn_eacute_es_source_vers_un_domaine_d_eacute_cimal_pour_eacute_viter_la_perte_de_donn_eacute_es"></a>4.17 Mapper la colonne Bigint dans les donn&eacute;es source vers un domaine d&eacute;cimal pour &eacute;viter la perte de donn&eacute;es</h3>
<div class="subsection">
<p>Si une colonne de vos donn&eacute;es source appartient au type de donn&eacute;es <em>bigint</em>, vous devez mapper la colonne vers un domaine appartenant au type de donn&eacute;es <em>d&eacute;cimal</em> plut&ocirc;t que <em>entier</em> dans DQS. La raison en est que le type de donn&eacute;es <em>d&eacute;cimal</em> repr&eacute;sente une plus grande plage de valeurs que le type de donn&eacute;es <em>int</em> et, par cons&eacute;quent, peut contenir des valeurs plus &eacute;lev&eacute;es.</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<p><a>[Haut]</a></p>
</div>
</div>
<a name="Database_Engine">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Database_Engine"></a>5.0 Database Engine</h1>
<span style="color:#ffffff;text-decoration:none;">
<h3 class="subHeading"><a name="L_ouverture_de_plusieurs_fichiers_SQL_d_eacute_marre_plusieurs_instances_de_SSMS"></a>5.1 L&#39;ouverture de plusieurs fichiers SQL d&eacute;marre plusieurs instances de SSMS</h3>
</span><a name="Database_Engine5">
<p>Si vous cliquez deux fois sur plusieurs fichiers .sql pour les ouvrir, une instance distincte de SQL Server Management Studio (SSMS) est d&eacute;marr&eacute;e pour chaque fichier. </p>
<p><strong>Solution :</strong> pour ouvrir plusieurs fichiers .sql dans une seule instance de SSMS, dans SSMS, cliquez sur <strong>Fichier</strong>, <strong>Ouvrir</strong>, puis utilisez le menu pour parcourir les fichiers.</p>
</a>
<h3 class="subHeading"><a name="SQL_Server_nom_de_code_laquo_Denali_raquo_introduit_une_nouvelle_mise_en_page_des_plans_de_maintenance"></a>5.2 SQL Server, nom de code &laquo; Denali &raquo; introduit une nouvelle mise en page des plans de maintenance</h3>
<a name="Database_Engine6">
<p>Lorsque les outils SQL Server nom de code &laquo; Denali &raquo; CTP3 sont utilis&eacute;s pour modifier un plan de maintenance existant cr&eacute;&eacute; dans une version pr&eacute;c&eacute;dente des outils de gestion de SQL Server (SQL Server 2008 R2, SQL Server 2008 ou SQL Server 2005), le plan de maintenance est enregistr&eacute; sous un nouveau format. Les versions pr&eacute;c&eacute;dentes des outils de gestion SQL Server ne prennent pas en charge ce nouveau format.</p>
</a>
<h3 class="subHeading"><a name="N_eacute_cessite_de_privil_egrave_ges_d_administrateur_pour_d_eacute_boguer_une_requ_ecirc_te_dans_SSMS"></a>5.3 N&eacute;cessite de privil&egrave;ges d&#39;administrateur pour d&eacute;boguer une requ&ecirc;te dans SSMS</h3>
<p>Lorsque SQL Server, nom de code &laquo; Denali &raquo; CTP3 Management Studio est ex&eacute;cut&eacute; en mode utilisateur normal, et vous tentez de d&eacute;boguer une requ&ecirc;te en utilisant le menu <strong>D&eacute;boguer</strong>, <strong>D&eacute;marrer le d&eacute;bogage</strong> ou &agrave; l&#39;aide de la touche de raccourci Alt+F5, une bo&icirc;te de dialogue d&#39;erreur s&#39;affiche et indique : </p>
<p class="style1"><em>&quot;Impossible de d&eacute;marrer le d&eacute;bogueur Transact-SQL. Connexion impossible au serveur &#39;nom de serveur&#39; de l&#39;ordinateur. Visual Studio ne dispose pas de privil&egrave;ges suffisants pour d&eacute;boguer ce processus. Pour d&eacute;boguer ce processus, Visual Studio doit &ecirc;tre ex&eacute;cut&eacute; en tant qu&#39;administrateur.&quot;</em></p>
<p>Ce probl&egrave;me est d&ucirc; au fait que SQL Server Management Studio ne dispose pas de privil&egrave;ges suffisants pour d&eacute;boguer le processus. </p>
<p><strong>Solution :</strong> pour &eacute;viter ce probl&egrave;me, d&eacute;marrez SQL Server Management Studio en activant l&#39;option &laquo; Ex&eacute;cuter en tant qu&#39;administrateur &raquo;.</p>
<h3 class="subHeading"><a name="R_eacute_installer_Visual_Studio_apr_egrave_s_avoir_install_eacute_SSMS"></a>5.4 R&eacute;installer Visual Studio apr&egrave;s avoir install&eacute; SSMS</h3>
<p>Lorsque vous installez SQL Server Management Studio nom de code &laquo; Denali &raquo; CTP3 ou SQL Server Management Studio Express nom de code &laquo; Denali &raquo; CTP3 sur un ordinateur qui ex&eacute;cute Visual Studio 2010 SP1, certains composants Visual Studio 2010 sont mis &agrave; jour vers le niveau de version Visual Studio 2010 SP1 et d&#39;autres non. Ce &laquo; mode mixte &raquo; de Visual Studio n&#39;est pas pris en charge. </p>
<p><strong>Solution :</strong> pour r&eacute;soudre ce probl&egrave;me, r&eacute;installez Visual Studio 2010 SP1, disponible au t&eacute;l&eacute;chargement depuis <a href="http://go.microsoft.com/fwlink/?LinkId=209902">cette page du Centre de t&eacute;l&eacute;chargement</a>.</p>
<h3 class="subHeading"><a name="La_bo_icirc_te_de_dialogue_Restaurer_dans_SSMS_se_fige_lorsque_les_fichiers_de_sauvegarde_requis_ne_sont_pas_sp_eacute_cifi_eacute_s"></a>5.5 La bo&icirc;te de dialogue Restaurer dans SSMS se fige lorsque les fichiers de sauvegarde requis ne sont pas sp&eacute;cifi&eacute;s</h3>
<p>Lorsqu&#39;un plan de restauration valide ne peut pas &ecirc;tre cr&eacute;&eacute; &agrave; partir d&#39;un jeu de fichiers de sauvegarde, la bo&icirc;te de dialogue Restaurer la base de donn&eacute;es se fige ind&eacute;finiment et ne r&eacute;pond plus. Cela se produit lorsque les fichiers requis par le plan de restauration ne sont pas sp&eacute;cifi&eacute;s. </p>
<p><strong>Solution :</strong> identifiez les fichiers de sauvegarde manquants et recr&eacute;ez le plan de restauration ou utilisez Transact-SQL pour restaurer directement la base de donn&eacute;es.</p>
<h3 class="subHeading"><a name="Le_transfert_SMO_de_bases_de_donn_eacute_es_exige_que_les_classements_de_colonne_et_de_base_de_donn_eacute_es_soient_identiques"></a>5.6 Le transfert SMO de bases de donn&eacute;es exige que les classements de colonne et de base de donn&eacute;es soient identiques</h3>
<p>SQL Server nom de code &laquo; Denali &raquo; CTP3 utilise l&#39;API SQLBulkCopy pour le transfert SMO. Pour &eacute;viter de corrompre les donn&eacute;es, SQL Server nom de code &laquo; Denali &raquo; CTP3 ne prend pas en charge le transfert SMO pour les bases de donn&eacute;es ayant des tables avec des classements de colonne diff&eacute;rents du classement de la base de donn&eacute;es. Il n&#39;existe pas de solution dans cette version.</p>
<h3 class="subHeading"><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a><a name="Le_point_de_contr_ocirc_le_d_utilitaire_CTP3_ne_fonctionne_pas_correctement_avec_SQL_Server_2008_SP2"></a>5.7 Le point de contr&ocirc;le d&#39;utilitaire CTP3 ne fonctionne pas correctement avec SQL Server 2008 SP2</h3>
<p>Le point de contr&ocirc;le d&#39;utilitaire de SQL Server nom de code &laquo; Denali &raquo; CTP3 ne fonctionne pas correctement avec les instances de SQL Server 2008 PCU2 lorsque ces deux produits sont install&eacute;s sur le m&ecirc;me ordinateur.</p>
<p><strong>Solutions :</strong></p>
<ul>
    <li>installez SQL Server 2008 SP2 et SQL Server nom de code &laquo; Denali &raquo; CTP3 sur des ordinateurs diff&eacute;rents et inscrivez ensuite l&#39;instance de SQL Server 2008 SP2 dans le point de contr&ocirc;le d&#39;utilitaire de SQL Server nom de code &laquo; Denali &raquo; CTP3. </li>
    <li>Si ces deux produits sont install&eacute;s sur le m&ecirc;me ordinateur, t&eacute;l&eacute;chargez et installez le package redistribuable Microsoft&reg; SQL Server&reg; 2008 R2 SP1 Shared Management Objects. </li>
</ul>
<h3 class="subHeading"><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a><a name="Les_syst_egrave_mes_d_exploitation_x64_requi_egrave_rent_PowerShell_2_0_64_bits"></a>5.8 Les syst&egrave;mes d&#39;exploitation x64 requi&egrave;rent PowerShell 2.0 64 bits</h3>
<p>Les installations 32 bits de Windows PowerShell Extensions pour SQL Server ne sont pas prises en charge pour les instances de SQL Server nom de code &laquo; Denali &raquo; CTP3 sur les syst&egrave;mes d&#39;exploitation 64 bits.</p>
<p><strong>Solutions :</strong></p>
<ul>
    <li>installez SQL Server nom de code &laquo; Denali &raquo; CTP3 64 bits avec les outils de gestion 64 bits et Windows PowerShell Extensions pour SQL Server 64 bits. </li>
    <li>Ou bien, importez le module SQLPS depuis l&#39;invite Windows PowerShell 2.0 32 bits. </li>
</ul>
<h3 class="subHeading"><a name="Impossible_de_charger_l_assembly_de_l_application_de_la_couche_Donn_eacute_es_dans_PowerShell"></a>5.9 Impossible de charger l&#39;assembly de l&#39;application de la couche Donn&eacute;es dans PowerShell</h3>
<p>Dans SQL Server nom de code &laquo; Denali &raquo; CTP3, les op&eacute;rations de script PowerShell avec des applications de la couche Donn&eacute;es (DAC) &eacute;chouent et g&eacute;n&egrave;rent une erreur, indiquant que l&#39;assembly Microsoft.SqlServer.Management.Dac ne peut pas &ecirc;tre charg&eacute;. Les assemblys DAC SQL Server nom de code &laquo; Denali &raquo; CTP3 sont compil&eacute;s &agrave; l&#39;aide de .Net Framework 4.0 et les assemblys .Net Framework 4.0 ne sont pris en charge dans aucune version actuelle de PowerShell. Il n&#39;existe aucune solution &agrave; ce probl&egrave;me ; les op&eacute;rations DAC ne sont pas prises en charge dans PowerShell pour SQL Server nom de code &laquo; Denali &raquo; CTP3.</p>
<h3 class="subHeading"><a name="Transact-SQL_IntelliSense_pour_de_nouveaux_mots_cl_eacute_s"></a>5.10 Transact-SQL IntelliSense pour de nouveaux mots cl&eacute;s</h3>
<p>La fonctionnalit&eacute; Transact-SQL IntelliSense de l&#39;&eacute;diteur de requ&ecirc;tes Database Engine n&#39;a pas &eacute;t&eacute; mise &agrave; jour pour prendre en charge toutes les nouvelles syntaxes introduites dans SQL Server nom de code &laquo; Denali &raquo; CTP3. Les nouveaux mots cl&eacute;s ne sont pas encod&eacute;s en tant que mots cl&eacute;s et sont soulign&eacute;s comme des erreurs de syntaxe. Nous pr&eacute;voyons actuellement d&#39;ajouter la prise en charge IntelliSense pour la nouvelle syntaxe dans la version future de SQL Server nom de code &laquo; Denali &raquo;.</p>
<p><strong>Solution :</strong> ignorez les erreurs de syntaxe. Les instructions Transact-SQL s&#39;ex&eacute;cuteront normalement.</p>
<h3 class="subHeading"><a name="Groupes_de_disponibilit_eacute_AlwaysOn"></a>5.11 Groupes de disponibilit&eacute; AlwaysOn</h3>
<p><span style="color:#ffffff;text-decoration:none;"><a name="Database_Engine3"></a><a name="Database_Engine4"></a><a name="Database_Engine2"><span style="color:#000000;">Avant de cr&eacute;er un groupe de disponibilit&eacute;, consultez </span></a><a href="http://go.microsoft.com/?linkid=9753168"><span style="color:#0000ff;">Conditions pr&eacute;alables, restrictions et recommandations pour les groupes de disponibilit&eacute; AlwaysOn (SQL Server)</span></a><span style="color:#000000;"> dans la documentation en ligne. Pour une introduction aux groupes de disponibilit&eacute; AlwaysOn, consultez </span><a href="http://go.microsoft.com/?linkid=9753166"><span style="color:#0000ff;">Groupes de disponibilit&eacute; AlwaysOn (SQL Server)</span></a><span style="color:#000000;"> dans la documentation en ligne. </span></span></p>
<a name="Database_Engine1"></a>
<h5><a name="Certaines_fonctionnalit_eacute_s_sont_prises_en_charge_uniquement_lorsque_l_indicateur_de_trace_9532_est_activ_eacute"></a>5.11.1 Certaines fonctionnalit&eacute;s sont prises en charge uniquement lorsque l&#39;indicateur de trace 9532 est activ&eacute;</h5>
<p>Dans CTP3, certaines fonctionnalit&eacute;s des Groupes de disponibilit&eacute; AlwaysOn ont une qualit&ea<a href="http://go.microsoft.com/?linkid=9753168"><span style="color:#0000ff;">Conditions pr&eacute;alables, restrictions et recommandations pour les groupes de disponibilit&eacute; AlwaysOn (SQL Server)</span></a><span style="color:#000000;"> dans la documentation en ligne. Pour une introduction aux groupes de disponibilit&eacute; AlwaysOn, consultez </span><a href="http://go.microsoft.com/?linkid=9753166"><span style="color:#0000ff;">Groupes de disponibilit&eacute; AlwaysOn (SQL Server)</span></a><span style="color:#000000;"> dans la documentation en ligne. </span></span></p>
<a name="Database_Engine1"></a>
<h5><a name="Certaines_fonctionnalit_eacute_s_sont_prises_en_charge_uniquement_lorsque_l_indicateur_de_trace_9532_est_activ_eacute"></a>5.11.1 Certaines fonctionnalit&eacute;s sont prises en charge uniquement lorsque l&#39;indicateur de trace 9532 est activ&eacute;</h5>
<p>Dans CTP3, certaines fonctionnalit&eacute;s des Groupes de disponibilit&eacute; AlwaysOn ont uncute; &laquo; aper&ccedil;u &raquo; et peuvent comporter davantage de bogues que d&#39;autres fonctionnalit&eacute;s. Les fonctionnalit&eacute;s de qualit&eacute; &laquo; aper&ccedil;u &raquo; sont sous le contr&ocirc;le de l&#39;indicateur de trace 9532. Nous vous encourageons &agrave; activer cet indicateur de trace afin de tester les fonctionnalit&eacute;s d&#39;aper&ccedil;u d&#39;AlwaysOn et de nous faire part de vos commentaires &agrave; ce sujet ainsi qu&#39;au sujet du jeu de fonctionnalit&eacute;s AlwaysOn restantes. </p>
<p>Les options Transact-SQL r&eacute;pertori&eacute;es ci-dessous sont prises en charge uniquement si l&#39;indicateur de trace 9532 est activ&eacute;. Si vous tentez d&#39;utiliser l&#39;une de ces options sans activer l&#39;indicateur de trace 9532, le moteur de base de donn&eacute;es g&eacute;n&eacute;rera l&#39;erreur : &quot;Cette fonction n&#39;est pas encore prise en charge&quot;.</p>
<p>Qualit&eacute; &laquo; aper&ccedil;u &raquo; Transact-SQL :</p>
<ul>
    <li>CREATE AVAILABILITY GROUP Transact-SQL : </li>
    <li>Utilisation de plus de deux clauses REPLICA ON </li>
    <li>FAILURE_CONDITION_LEVEL </li>
    <li>HEALTH_CHECK_TIMEOUT </li>
    <li>SESSION_TIMEOUT </li>
    <li>Utilisation de l&#39;une des options ALTER AVAILABILITY GROUP Transact-SQL suivantes : </li>
    <li>ADD REPLICA ON </li>
    <li>REMOVE REPLICA ON </li>
    <li>ADD DATABASE </li>
    <li>REMOVE DATABASE </li>
    <li>ENDPOINT_URL </li>
    <li>FAILURE_CONDITION_LEVEL </li>
    <li>HEALTH_CHECK_TIMEOUT </li>
    <li>SESSION_TIMEOUT </li>
    <li>PRIMARY_ROLE (ALLOW_CONNECTIONS, READ_ONLY_ROUTING_LIST) </li>
    <li>SECONDARY_ROLE (ALLOW_CONNECTIONS, READ_ONLY_ROUTING_URL) </li>
</ul>
<p>En plus d&#39;activer ces options Transact-SQL, l&#39;activation de l&#39;indicateur de trace <span style="font-family:tahoma,sans-serif;color:#000000;">9532 </span>active &eacute;galement les options SQL Server Management Studio correspondantes et les cmdlets PowerShell ou les param&egrave;tres cmdlet. </p>
<p>Pour tester les fonctionnalit&eacute;s de qualit&eacute; &laquo; aper&ccedil;u &raquo;, activez l&#39;indicateur de trace <span style="font-family:tahoma,sans-serif;color:#000000;">9532</span> sur chaque instance de serveur qui h&eacute;berge un r&eacute;plica de disponibilit&eacute; pour un groupe de disponibilit&eacute; donn&eacute;.</p>
<h5><a name="La_suppression_et_la_nouvelle_cr_eacute_ation_d_un_cluster_WSFC_n_eacute_cessite_la_d_eacute_sactivation_et_la_r_eacute_activation_des_groupes_de_disponibilit_eacute_AlwaysOn"></a>5.11.2 La suppression et la nouvelle cr&eacute;ation d&#39;un cluster WSFC n&eacute;cessite la d&eacute;sactivation et la r&eacute;activation des groupes de disponibilit&eacute; AlwaysOn</h5>
<p>Si vous supprimez et recr&eacute;ez le cluster WSFC sur lequel vous avez d&eacute;ploy&eacute; des groupes de disponibilit&eacute;, vous devez d&eacute;sactiver et r&eacute;activer la fonctionnalit&eacute; Groupes de disponibilit&eacute; AlwaysOn sur chaque instance de serveur sur laquelle cette fonctionnalit&eacute;s a &eacute;t&eacute; activ&eacute;e sur le cluster WSFC d&#39;origine. Pour plus d&#39;informations, consultez &laquo; Activer et d&eacute;sactiver AlwaysOn (SQL Server) &raquo; dans la documentation en ligne.</p>
<h5><a name="Connectivit_eacute_du_client_pour_les_groupes_de_disponibilit_eacute_AlwaysOn_dans_CTP3"></a>5.11.3 Connectivit&eacute; du client pour les groupes de disponibilit&eacute; AlwaysOn dans CTP3</h5>
<p>Cette section d&eacute;crit la prise en charge du pilote pour les groupes de disponibilit&eacute; AlwaysOn et les solutions disponibles pour utiliser ADO.NET avec .NET Framework 4.0 ou SQL Native Client 11.0 OLEDB pour le basculement de sous-r&eacute;seaux multiples.</p>
<p><strong>Prise en charge de pilote</strong></p>
<p>Le tableau suivant r&eacute;capitule les pilotes pris en charge pour les groupes de disponibilit&eacute; AlwaysOn dans CTP3.</p>
<table class="style8" border="0" cellspacing="0" cellpadding="0">
    <tbody>
        <tr>
            <td style="padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;padding-top:0in;border:windowtext 1pt solid;" valign="top">
            <p><span class="style9">Pilote </span></p>
            </td>
            <td style="border-bottom:windowtext 1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:windowtext 1pt solid;border-right:windowtext 1pt solid;padding-top:0in;" valign="top">
            <p><span class="style9">Basculement de sous-r&eacute;seaux multiples </span></p>
            </td>
            <td style="border-bottom:windowtext 1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:windowtext 1pt solid;border-right:windowtext 1pt solid;padding-top:0in;" valign="top">
            <p><span class="style9">ApplicationIntent </span></p>
            </td>
            <td style="border-bottom:windowtext 1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:windowtext 1pt solid;border-right:windowtext 1pt solid;padding-top:0in;" valign="top">
            <p><span class="style9">Routage en lecture seule </span></p>
            </td>
        </tr>
        <tr>
            <td style="border-bottom:1pt solid;border-left:1pt solid;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>SQL Native Client 11.0 ODBC </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Oui </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Oui </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Oui </p>
            </td>
        </tr>
        <tr>
            <td style="border-bottom:1pt solid;border-left:1pt solid;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:QL Native Client 11.0 ODBC </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Oui </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;bo1pt solid;padding-top:0in;" valign="top">
            <p>SQL Native Client 11.0 OLEDB </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Non </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Oui </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Oui </p>
            </td>
        </tr>
        <tr>
            <td style="border-bottom:1pt solid;border-left:1pt solid;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>ADO.NET avec .NET Framework 4.0 </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p><span style="color:#000000;">Q4 CY2011<b><sup>*</sup></b></span> </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Q4 CY2011 </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Q4 CY2011 </p>
            </td>
        </tr>
        <tr>
            <td style="border-bottom:1pt solid;border-left:1pt solid;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Pilote Microsoft JDBC 4.0 pour SQL Server </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Oui </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p>Oui </p>
            </td>
            <td style="border-bottom:1pt solid;border-left:medium none;padding-bottom:0in;padding-left:5.4pt;padding-right:5.4pt;border-top:medium none;border-right:1pt solid;padding-top:0in;" valign="top">
            <p><span style="color:#000000;">Q4 CY2011</span> </p>
            </td>
        </tr>
    </tbody>
</table>
<p><b><sup><span style="color:#1f497d;">*</span></sup></b> Q4 CY2011 indique le quatri&egrave;me trimestre de l&#39;ann&eacute;e calendaire 2011.</p>
<p><strong>MultiSubnetFailover=True non pris en charge par NET Framework ou OLEDB</strong></p>
<p>Dans CTP3, seul SQL Native Client 11.0 ODBC prend en charge <b>MultiSubnetFailover=True</b>. </p>
<p>Si vous avez cr&eacute;&eacute; un groupe de disponibilit&eacute; avec un nom d&#39;&eacute;couteur (&eacute;galement appel&eacute; &laquo; nom de r&eacute;seau &raquo; ou &laquo; point d&#39;acc&egrave;s client &raquo; dans le gestionnaire de cluster WSFC) et vous utilisez soit ADO.NET avec .NET Framework 4.0 soit SQL Native Client 11.0 OLEDB, potentiellement, 50 % de vos demandes de connexion client &agrave; l&#39;&eacute;couteur du groupe de disponibilit&eacute; vont d&eacute;passer le d&eacute;lai de connexion autoris&eacute;. </p>
<p><strong>Solutions :</strong> nous vous recommandons d&#39;effectuer l&#39;une des t&acirc;ches suivantes.</p>
<ul>
    <li>Si vous ne disposez pas d&#39;une autorisation pour manipuler les ressources du cluster, d&eacute;finissez le d&eacute;lai de connexion &agrave; 30 secondes (cette valeur correspond au d&eacute;lai TCP de 20 secondes plus un tampon de 10 secondes). </li>
    <li>Pros : si un basculement de sous-r&eacute;seaux crois&eacute; se produit, la dur&eacute;e de r&eacute;cup&eacute;ration du client est courte. </li>
    <li>Cons : la moiti&eacute; des connexions clients prendront plus de 20 secondes. </li>
    <li>Si vous disposez d&#39;une autorisation vous permettant de manipuler les ressources du cluster, l&#39;approche privil&eacute;gi&eacute;e consiste &agrave; d&eacute;finir le nom du r&eacute;seau de votre &eacute;couteur de groupe de disponibilit&eacute; en tant que <b>RegisterAllProvidersIP</b>=0. Pour plus d&#39;informations, consultez la section &laquo; Exemple de script PowerShell pour d&eacute;sactiver RegisterAllProvidersIP et r&eacute;duire TTL &raquo;, plus loin dans cette rubrique. </li>
    <li>Pros : vous n&#39;avez pas besoin d&#39;augmenter la valeur du d&eacute;lai de connexion du client. </li>
    <li>Cons : si un basculement de sous-r&eacute;seaux crois&eacute;s se produit, la dur&eacute;e de r&eacute;cup&eacute;ration du client peut &ecirc;tre de 15 minutes ou plus, en fonction de votre param&egrave;tre <b>HostRecordTTL</b> et du param&egrave;tre de votre planification de la r&eacute;plication DNS/AD entre sites. </li>
</ul>
<p><strong>Exemple de script PowerShell pour d&eacute;sactiver RegisterAllProvidersIP et r&eacute;duire TTL</strong></p>
<p>L&#39;exemple de script PowerShell suivant montre comment d&eacute;sactiver RegisterAllProvidersIP et r&eacute;duire TTL. Remplacez le <i><span style="color:#1f497d;">nom de votre &eacute;couteur</span></i> avec le nom de l&#39;&eacute;couteur que vous modifiez.</p>
<p class="style16"><span style="position:relative;top:0pt;" class="style13">Import-Module FailoverClusters</span></p>
<p class="style10"><span style="position:relative;top:0pt;" class="style15">Set-ClusterResource </span><i><span class="style14">nom de votre &eacute;couteur</span></i><span style="position:relative;top:0pt;" class="style14">|Set-ClusterParameter RegisterAllProvidersIP 0</span></p>
<p class="style10"><span style="position:relative;top:0pt;" class="style15">Set-ClusterResource </span><i><span class="style14">nom de votre &eacute;couteur</span></i><span style="position:relative;top:0pt;" class="style14">|Set-ClusterParameter HostRecordTTL 300</span></p>
<p><a>[Haut]</a></p>
<a name="Integration_Services">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Integration_Services"></a>6.0 Integration Services</h1>
<div id="sectionSection4" class="section">
<div class="subsection"></div>
</div>
<div id="sectionSection4" class="section">
<div class="subsection"><a name="Integration_Services0">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Comment_passer_agrave_la_page_suivante_dans_des_longs_rapports"></a>6.1 Comment passer &agrave; la page suivante dans des longs rapports</h3>
<div class="subsection">
<p>Lorsque vous affichez un rapport standard dans SQL Server Management Studio pour d&eacute;panner des packages Integration Services, et lorsque le rapport comprend plusieurs pages, appuyez sur PG. SUIV. ou utilisez le d&eacute;filement pour vous d&eacute;placer dans les diff&eacute;rentes pages.</p>
</div>
<p><a>[Haut]</a></p>
<a name="Master_Data_Services">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Master_Data_Services"></a>7.0 Master Data Services</h1>
<div id="sectionSection8" class="section">
<div class="subsection"></div>
</div>
<div id="sectionSection8" class="section">
<div class="subsection"><a name="Integration_Services2">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Les_API_ne_sont_pas_destin_eacute_es_agrave_ecirc_tre_utilis_eacute_es"></a>7.1 Les API ne sont pas destin&eacute;es &agrave; &ecirc;tre utilis&eacute;es</h3>
<div class="subsection">
<p>Les API suivantes prennent en charge l&#39;infrastructure MDS et ne sont pas destin&eacute;es &agrave; &ecirc;tre utilis&eacute;es directement &agrave; partir de votre code. Pour obtenir la liste de ces API, consultez </p>
</div>
<div class="subsection">
<p><a href="http://go.microsoft.com/fwlink/p/?LinkID=217348">Nouveaut&eacute;s de Master Data Services dans Denali CTP3</a>.</p>
<a name="Integration_Services3">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Impossible_d_afficher_les_noms_pour_les_attributs_bas_eacute_s_sur_un_domaine"></a>7.2 Impossible d&#39;afficher les noms pour les attributs bas&eacute;s sur un domaine</h3>
<div class="subsection">
<p>Dans le compl&eacute;ment Master Data Services (MDS) pour Excel, seul le code est affich&eacute; pour les attributs bas&eacute;s sur un domaine. Si vous tentez de visualiser la colonne Nom en cliquant sur le bouton <strong>Param&egrave;tres</strong>, puis, si dans la section <strong>Donn&eacute;es</strong>, vous s&eacute;lectionnez <strong>Afficher la colonne de nom</strong> pour les attributs bas&eacute;s sur un domaine, Excel peut ne plus r&eacute;pondre.</p>
<p><strong>Solution :</strong> red&eacute;marrez Excel et d&eacute;sactivez l&#39;option.</p>
</div>
<div class="subsection"><a name="Integration_Services4">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="L_actualisation_peut_entra_icirc_ner_une_absence_de_r_eacute_ponse_de_la_part_d_Excel"></a>7.3 L&#39;actualisation peut entra&icirc;ner une absence de r&eacute;ponse de la part d&</a>7.2 Impossible d&#39;afficher les noms pour les attributs bas&eacute;s sur un domaine</h3>
<div class="subsection">
<p>Dans le compl&eacute;ment Master Data Services (MDS) pou#39;Excel</h3>
<div class="subsection">
<p>Dans le compl&eacute;ment </p>
</div>
<div class="subsection">
<p><a name="Integration_Services5">Master Data Services (MDS)</a> pour Excel, lorsque vous cliquez sur le bouton <strong>Actualiser</strong> de l&#39;onglet Donn&eacute;es de r&eacute;f&eacute;rence, Excel peut ne plus r&eacute;pondre. Ce probl&egrave;me se produit lorsque des changements ont &eacute;t&eacute; apport&eacute;s &agrave; l&#39;entit&eacute; depuis la derni&egrave;re actualisation de la feuille de calcul. </p>
<p><strong>Solution :</strong> supprimez la feuille de calcul et chargez l&#39;entit&eacute; mise &agrave; jour dans une nouvelle feuille de calcul.</p>
<a name="Integration_Services6"></a><a name="Integration_Services7">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Le_compl_eacute_ment_est_uniquement_disponible_pour_l_utilisateur_qui_l_a_install_eacute"></a>7.4 Le compl&eacute;ment est uniquement disponible pour l&#39;utilisateur qui l&#39;a install&eacute;</h3>
<div class="subsection">
<p>Le compl&eacute;ment </p>
</div>
<div class="subsection">
<p><a name="Integration_Services8">Master Data Services (MDS)</a> pour Excel est install&eacute; uniquement pour l&#39;utilisateur qui est connect&eacute;. Il n&#39;est pas visible aux autres utilisateurs qui ouvrent Excel &agrave; partir du m&ecirc;me ordinateur.</p>
<p><strong>Solution :</strong> chaque utilisateur individuel qui est un administrateur doit installer le compl&eacute;ment.</p>
</div>
</div>
</div>
</div>
<p><a>[Haut]</a></p>
</div>
</div>
</div>
</div>
<a name="Reporting_Services">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Reporting_Services"></a>8.0 Reporting Services</h1>
<div id="sectionSection5" class="section">
<h3 class="subHeading"><a name="Une_erreur_se_produit_lorsque_vous_cr_eacute_ez_une_application_de_service_Reporting_Services"></a>8.1 Une erreur se produit lorsque vous cr&eacute;ez une application de service Reporting Services</h3>
<div class="subsection">
<p>En mode int&eacute;gr&eacute; SharePoint, lorsque vous essayez de cr&eacute;er une application de service SQL Server Reporting Services, un message d&#39;erreur semblable au suivant s&#39;affiche.</p>
<p class="style1"><em>&Eacute;chec de la connexion pour l&#39;utilisateur &#39;NT AUTHORITY\NETWORK SERVICE&#39;</em></p>
<p><strong>Solution :</strong> Configurez la base de donn&eacute;es distante pour l&#39;acc&egrave;s SharePoint &agrave; l&#39;aide de l&#39;une des deux proc&eacute;dures suivantes :</p>
<ul>
    <li>Fournissez un script de base de donn&eacute;es de service SSRS &agrave; l&#39;administrateur de base de donn&eacute;es de l&#39;instance SQL distante.
    <ol>
        <li>Ex&eacute;cutez l&#39;applet de commande PowerShell pour cr&eacute;er le script T-SQL :<br />
        <em>Get-SPRSCreateDatabaseScripts -nombasededonn&eacute;es -nomutilisateur</em> </li>
        <li>L&#39;administrateur de base de donn&eacute;es de l&#39;instance SQL distante ex&eacute;cute le script sur l&#39;ordinateur distant. </li>
        <li>Ex&eacute;cutez la page &#39;de cr&eacute;ation d&#39;application de service SSRS&#39;, puis sp&eacute;cifiez la base de donn&eacute;es de service qui a obtenu les droits via le script. </li>
    </ol>
    </li>
    <li>Octroyez l&#39;acc&egrave;s au propri&eacute;taire de la base de donn&eacute;es du groupe Administrateur de batterie de serveurs SharePoint &agrave; l&#39;instance SQL Server distante :
    <ol>
        <li>Faites en sorte qu&#39;un administrateur de base de donn&eacute;es SQL de l&#39;instance SQL distante octroie l&#39;acc&egrave;s du propri&eacute;taire de base de donn&eacute;es au groupe Administrateur de batterie de serveurs SharePoint. </li>
        <li>Ex&eacute;cutez la page &#39;de cr&eacute;ation d&#39;application de service SSRS&#39;. </li>
    </ol>
    </li>
</ul>
<div class="subsection"></div>
</div>
</div>
<div id="sectionSection5" class="section">
<div class="subsection">
<div class="subsection"><a name="Reporting_Services2">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Les_abonnements_pilot_eacute_s_par_des_donn_eacute_es_et_le_concepteur_de_requ_ecirc_tes_MDX_ne_fonctionnent_pas_avec_une_source_de_donn_eacute_es_AS"></a>8.2 Les abonnements pilot&eacute;s par des donn&eacute;es et le concepteur de requ&ecirc;tes MDX ne fonctionnent pas avec une source de donn&eacute;es AS</h3>
<div class="subsection">
<p>L&#39;int&eacute;gration de SQL Server nom de code &laquo; Denali &raquo; Reporting Services dans Analysis Services (AS) repose sur un module de code que se partagent plusieurs composants SQL Server. Dans Denali CTP3, la fonction des abonnements pilot&eacute;s par des donn&eacute;es du serveur de rapports et la fonction du concepteur de requ&ecirc;tes MDX ne peuvent pas afficher le module de code. </p>
<p>Si vous tentez de cr&eacute;er ou de modifier un abonnement pilot&eacute; par des donn&eacute;es avec une requ&ecirc;te de remise qui obtient des donn&eacute;es aupr&egrave;s d&#39;Analysis Services &agrave; l&#39;aide de MDX, vous recevez une erreur. Si vous tentez d&#39;utiliser le concepteur de requ&ecirc;tes MDX pour cr&eacute;er ou modifier une instruction MDX qui obtient des donn&eacute;es aupr&egrave;s d&#39;Analysis Services, vous recevez une erreur. L&#39;erreur suivante risque d&#39;appara&icirc;tre :</p>
<p class="style1">&laquo; Impossible de charger le fichier ou l&#39;assembly &#39;msmgdsrv, Version=9.0.0.0, Culture=neutral, PublicKeyToken=89845dcd8080cc91&#39; ou une de ses d&eacute;pendances. L&#39;assembly est g&eacute;n&eacute;r&eacute; par un runtime plus r&eacute;cent que le runtime actuellement charg&eacute; et il ne peut pas &ecirc;tre charg&eacute;. &raquo;</p>
<p><strong>S</strong></p>
</div>
<div class="subsection">
<p><strong>olution :</strong> appliquez la proc&eacute;dure suivante :</p>
<ol>
    <li>Pour corriger le probl&egrave;me concernant le concepteur de requ&ecirc;tes MDX, installez le fournisseur OLE DB Microsoft&reg; Analysis Services pour Microsoft&reg; SQL Server&reg; 2008 R2 sp&eacute;cifique de votre architecture.
    <ul>
        <li>T&eacute;l&eacute;chargez le fournisseur sur <a href="http://go.microsoft.com/?linkid=9776344">cette page du Centre de t&eacute;l&eacute;chargement Microsoft</a>. </li>
    </ul>
    </li>
    <li>Pour corriger le probl&egrave;me conclaquo; Impossible de charger le fichier ou l&#39;assembly &#39;msmgdsrv, Version=9.0.0.0, Culture=neutral, PublicKeyToken=89845dcd8080cc91&#39; ou une de ses d&eacute;pendances. L&#39;assembly est g&eacute;n&eacute;r&eacute; par un runtime plus r&eacute;cent que le runtime actuellement charg&eacute; et il ne peut pas &ecirc;tre charg&eacute;. &raquo;</p>
<p><strong>S</strong></p>
</div>
<div class="subsection">
<p><strong>olution :</strong> appliquez la proc&eacute;dure suivante :</p>
<ol>
    <li>Pour corriger le problernant les abonnements pilot&eacute;s par les donn&eacute;es SSRS, proc&eacute;dez de la mani&egrave;re suivante :
    <ol>
        <li>Modifiez le fichier web.config Reporting Services comme d&eacute;crit dans la <a href="http://go.microsoft.com/?linkid=9776345">documentation .NET 3.5</a>. Le param&egrave;tre est repr&eacute;sent&eacute; ci-apr&egrave;s. </li>
        <li>Modifiez le fichier de configuration comme suit : </li>
    </ol>
    </li>
</ol>
<p class="style21">&lt;configuration&gt;<br />
&lt;runtime&gt;<br />
&amp; &lt;assemblyBinding xmlns=&quot;urn:schemas-microsoft-com:asm.v1&quot;&gt;<br />
&lt;dependentAssembly&gt;<br />
&lt;assemblyIdentity name=&quot;msmgdsrv&quot; publicKeyToken=&quot;89845dcd8080cc91&quot; /&gt;<br />
&lt;codeBase version=&quot;9.0.0.0&quot; href=&quot;[ProgramFiles_path]\Microsoft Analysis Services\AS OLEDB\10\msmgdsrv.dll&quot;/&gt;<br />
&lt;/dependentAssembly&gt; <br />
&lt;/assemblyBinding&gt;<br />
&lt;/runtime&gt;<br />
&lt;/configuration&gt; </p>
<a name="Database_Engine0">
<div class="subsection">
<div class="alert">
<table cellspacing="0" cellpadding="0" width="100%">
    <tbody>
        <tr>
            <th align="left"><b>Remarque</b></th>
        </tr>
        <tr>
            <td>
            <p>V&eacute;rifiez que vous avez d&eacute;fini la valeur dans href pour pointer vers l&#39;assembly install&eacute; avec le fournisseur OLE DB Analysis Services.</p>
            </td>
        </tr>
    </tbody>
</table>
</div>
</div>
</a></div>
</div>
<a name="Reporting_Services3"><span style="color:#ffffff;text-decoration:none;"></span></a><a name="Reporting_Services4">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="La_mise_en_surbrillance_de_la_syntaxe_MDX_dans_SSMS_n_est_pas_disponible"></a>8.3 La mise en surbrillance de la syntaxe MDX dans SSMS n&#39;est pas disponible</h3>
<div class="subsection">
<p>Lorsque vous &eacute;crivez une requ&ecirc;te ou une instruction MDX dans la fen&ecirc;tre de requ&ecirc;tes MDX SQL Server Denali SQL Server Management Studio (SSMS), aucune mise en surbrillance de syntaxe des instructions incorrectes ne s&#39;affiche. &Agrave; ce jour, il n&#39;existe aucune solution &agrave; ce probl&egrave;me avec SSMS pour SQL Server nom de code &laquo; Denali &raquo;. La fonctionnalit&eacute; est disponible dans SQL Server 2008 R2.</p>
</div>
<div class="subsection"></div>
<div class="subsection"></div>
<a name="Reporting_Services5">
<h3 class="subHeading"></h3>
</a>
<h3 class="subHeading"><a name="Les_fichiers_PDW_SQL_Server_ne_fonctionnent_pas_dans_BIDS_et_RB"></a>8.4 Les fichiers PDW SQL Server ne fonctionnent pas dans BIDS et RB</h3>
<div class="subsection">
<p>Les fichiers d&#39;extension de donn&eacute;es SQL Server PDW ne fonctionnent pas dans Business Intelligences Development Studio (BIDS) et le G&eacute;n&eacute;rateur de rapports (RB) dans SQL Server nom de code &laquo; Denali &raquo; CTP3. L&#39;extension de donn&eacute;es ne peut pas &ecirc;tre charg&eacute;e lors de l&#39;ex&eacute;cution de la requ&ecirc;te. Le bouton Modifier est d&eacute;sactiv&eacute; dans la bo&icirc;te de dialogue de propri&eacute;t&eacute; de la source de donn&eacute;es.</p>
</div>
<div class="subsection"></div>
<h3 class="subHeading"><a name="Texte_en_anglais_pr_eacute_sent_dans_les_versions_chinoises_du_croissant_du_projet_et_dans_des_alertes_SSRS"></a>8.5 Texte en anglais pr&eacute;sent dans les versions chinoises du croissant du projet et dans des alertes SSRS </h3>
<p>Dans ces versions du croissant du projet et dans les alertes de SQL Server Reporting Services (SSRS) dans Microsoft SQL Server nom de code &laquo; Denali &raquo; version pr&eacute;liminaire CTP3, le texte de ces interfaces utilisateur locales est en anglais : </p>
<ul>
    <li>Chinois simplifi&eacute; (CHS) </li>
    <li>Chinois traditionnel (CHT) </li>
</ul>
<p>Ce comportement est attendu pour ce CTP. Nous pr&eacute;voyons de localiser ce texte pour la version publi&eacute;e de Microsoft SQL Server nom de code &laquo; Denali &raquo;.</p>
<h3 class="subHeading"><a name="Les_modifications_du_fichier_de_configuration_ne_sont_pas_conserv_eacute_es"></a>8.6 Les modifications du fichier de configuration ne sont pas conserv&eacute;es </h3>
<p>Si vous mettez &agrave; niveau un ordinateur &agrave; partir d&#39;une version CTP pr&eacute;c&eacute;dente de Microsoft SQL Server nom de code &laquo; Denali &raquo;, et que vous aviez effectu&eacute; des modifications personnalis&eacute;es aux fichiers de configuration, vous devrez apporter les m&ecirc;mes modifications aux fichiers de configuration apr&egrave;s la mise &agrave; niveau vers SQL Server nom de code &laquo; Denali &raquo; version pr&eacute;liminaire CTP3. </p>
<p>Les fichiers suivants sont concern&eacute;s : </p>
<ul>
    <li>web.config </li>
    <li>client.config </li>
</ul>
<p><strong>Solution : </strong></p>
<ol>
    <li>Effectuez une copie de sauvegarde des fichiers de configuration avant d&#39;ex&eacute;cuter le programme d&#39;installation SQL Server. </li>
    <li>Ex&eacute;cutez le programme d&#39;installation de SQL Server. </li>
    <li>Modifiez manuellement les fichiers de configuration et ajoutez vos entr&eacute;es personnalis&eacute;es. </li>
</ol>
<h3 class="subHeading"><a name="Le_texte_localis_eacute_en_chinois_dans_le_croissant_du_projet_n_est_pas_disponible_actuellement"></a>8.7 Le texte localis&eacute; en chinois dans le croissant du projet n&#39;est pas disponible actuellement</h3>
<p>La localisation en chinois simplifi&eacute; et en chinois traditionnel n&#39;est pas disponible dans le croissant du projet dans SQL Server nom de code &laquo; Denali &raquo; CTP3. C&#39;est un probl&egrave;me connu et nous pr&eacute;voyons de le r&eacute;soudre avant la publication de Microsoft SQL Server nom de code &laquo; Denali &raquo;. </p>
<h3 class="subHeading"><a name="Project_Crescent_avec_un_client_en_version_arabe_impossible_d_ajouter_des_champs_de_date_dans_CTP3"></a>8.8 Project Crescent avec un client en version arabe : impossible d&#39;ajouter des champs de date dans CTP3</h3>
<p>Dans Microsoft SQL Server nom de code &laquo; Denali &raquo; CTP3, lorsque vous utilisez Project Crescent dans un client en version arabe, si vous faites glisser un champ de date dans la zone des filtres, vous obtenez un message d&#39;erreur System.ArgumentOutOfRangeException. Par cons&eacute;quent, vous ne pouvez pas filtrer sur un champ de date dans la zone Filtres dans la version CTP3 de Project Crescent. Nous travaillons actuellement &agrave; la r&eacute;solution de ce probl&egrave;me. </p>
<p><strong>Solution :</strong> pour la version CTP3 de Project Crescent, vous pouvez utiliser d&#39;autres m&eacute;thodes de filtrage, tels que les segments. </p>
<p><a>[Haut]</a></p>
<h1 class="heading"><a name="StreamInsight"></a>9.0 StreamInsight</h1>
<div id="sectionSection9" class="section">
<h3 class="subHeading"><a name="T_eacute_l_eacute_charger_StreamInsight"></a>9.1 T&eacute;l&eacute;charger StreamInsight</h3>
<div class="subsection">
<p>Cette version de Microsoft SQL Server nom de code &laquo; Denali &raquo; inclut une version anglaise pr&eacute;liminaire de Microsoft StreamInsight 1.2 sur le support d&#39;installation. Pour t&eacute;l&eacute;charger la version finale de StreamInsight 1.2 en anglais ou dans une autre langue, rendez-vous sur la <span style="color:#1f497d;"><a href="http://go.microsoft.com/fwlink/?LinkID=221299">page de t&eacute;l&eacute;chargement de StreamInsight dans le centre de t&eacute;l&eacute;chargement Microsoft</a></span>.</p>
<p><a>[Haut]</a></p>
</div>
</div>
</div>
</div>
<a name="Upgrade_Advisor">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Conseiller_de_mise_agrave_niveau"></a>10.0 Conseiller de mise &agrave; niveau</h1>
<div id="sectionSection7" class="section">
<h3 class="subHeading"><a name="Le_lien_permettant_d_installer_le_conseiller_de_mise_agrave_niveau_n_est_pas_activ_eacute_sur_les_syst_egrave_mes_d_exploitation_chinois_HK"></a>10.1 Le lien permettant d&#39;installer le conseiller de mise &agrave; niveau n&#39;est pas activ&eacute; sur les syst&egrave;mes d&#39;exploitation chinois (HK)</h3>
<div class="subsection">
<p>Lorsque vous essayez d&#39;installer le conseiller de mise &agrave; niveau sur des syst&egrave;mes d&#39;exploitation prenant en charge une version Windows en chinois (Hong-Kong), le lien permettant l&#39;installation risque de ne pas &ecirc;tre activ&eacute;.</p>
<p><strong>Solution :</strong> localisez le fichier SQLUA.msi sur votre serveur support SQL Server &laquo; Denali &raquo; dans <em>\\1028_CHT_LP\x64\redist\Upgrade Advisor ou \1028_CHT_LP\x86\redist\Upgrade Advisor</em>, selon l&#39;architecture de votre syst&egrave;me d&#39;exploitation. </p>
</div>
</div>
<div id="sectionSection7" class="section">
<div class="subsection">
<p><a>[Haut]</a></p>
</div>
</div>
<a name="How_to_Find">
<h1 class="heading"></h1>
</a>
<h1 class="heading"><a name="Recherche_d_autres_probl_egrave_mes_connus"></a>11.0 Recherche d&#39;autres probl&egrave;mes connus</h1>
<div></div>
<div>
<p>Vous pouvez rejoindre la communaut&eacute; SQL Server pour partager vos exp&eacute;riences et apprendre aupr&egrave;s d&#39;autres utilisateurs de SQL Server nom de code &laquo; Denali &raquo;. Pour plus d&#39;informations, consultez les <a href="http://go.microsoft.com/?linkid=9753169">forums SQL Server &laquo; Denali &raquo;</a>, le <a href="http://go.microsoft.com/?linkid=9753170">Centre des commentaires Connect pour Microsoft SQL Server</a> (pour rechercher et d&eacute;poser des bogues ou suggestions) et le site Web de la <a href="http://go.microsoft.com/fwlink/?LinkId=124388">communaut&eacute; SQL Server</a>.</p>
<p>&copy; 2011 Microsoft Corporation. Tous droits r&eacute;serv&eacute;s. </p>
</diection">
<div class="subsection">
<p><a>[Haut]</a></p>
</div>
</div>
<a name="Hov>
</div>
</div>
</div></div>
    
    
